//
//  ViewController.swift
//  Aphasia
//
//  Created by 唐烁 on 2021/8/24.
//

import UIKit
import AVFoundation
import MediaPlayer

class Word{
    var str:String?
    var colorIndex:Int?
}

let labelColor = [#colorLiteral(red: 0.431372549, green: 0.4156862745, blue: 0.8745098039, alpha: 1),
                  #colorLiteral(red: 0.9803921569, green: 0.6196078431, blue: 0.4196078431, alpha: 1),
                  #colorLiteral(red: 0.8470588235, green: 0.4117647059, blue: 1, alpha: 1),
                  #colorLiteral(red: 0.4588235294, green: 0.7803921569, blue: 0.7137254902, alpha: 1),
                  #colorLiteral(red: 0.5019607843, green: 0.7411764706, blue: 0.9764705882, alpha: 1)]

let backgroudColor = [#colorLiteral(red: 0.9607843137, green: 0.9607843137, blue: 0.9764705882, alpha: 1),
                      #colorLiteral(red: 1, green: 0.9607843137, blue: 0.9411764706, alpha: 1),
                      #colorLiteral(red: 0.9921568627, green: 0.9764705882, blue: 1, alpha: 1),
                      #colorLiteral(red: 0.9647058824, green: 1, blue: 0.9921568627, alpha: 1),
                      #colorLiteral(red: 0.9647058824, green: 0.9843137255, blue: 1, alpha: 1)]

class ViewController: UIViewController,PopOverDelegate, AVSpeechSynthesizerDelegate {
    func insertWord(word: String, colorIndex: Int, pos: Int) {
        choosedData.insert(word, at: pos)
        choosedColor.insert(colorIndex, at: pos)
        len4Choosed += 1;
        wordCollectionView.reloadData()
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
        len4Undo += 1
    }
    
    func addWord(words: [String], colorIndex: Int) {
        for word in words {
            choosedData.append(word)
            choosedColor.append(colorIndex)
        }
        len4Choosed += words.count
        wordCollectionView.reloadData()
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
        len4Undo += 1
    }
    
    func deleteWord(pos:Int) {
        choosedData.remove(at: pos)
        choosedColor.remove(at: pos)
        len4Choosed -= 1;
        wordCollectionView.reloadData()
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
        len4Undo += 1
    }
    
    func setBtnState(){
        sportBtn.isSelected = false
        relationBtn.isSelected = false
        decorationBtn.isSelected = false
        toneBtn.isSelected = false
        let cell = chooseCollectionView.cellForItem(at: IndexPath.init(item: chooseTop, section: 0)) as! ChooseCollectionViewCell
        cell.isSelected = false
    }
    
    //视图控件
    @IBOutlet var selectView: UIView!
    @IBOutlet var backGroundView: UIView!
    @IBOutlet var tipLabel: UILabel!
    @IBOutlet var chooseCollectionView: UICollectionView!
    @IBOutlet weak var resultView: UIView!
    @IBOutlet weak var btnSelected: UIView!
    @IBOutlet weak var sentenceSelected: UIView!
    @IBOutlet weak var wordSelectView: UIView!
    
    // 按钮控件
    @IBOutlet weak var clearBtn: UIButton!
    @IBOutlet weak var deleteBtn: UIButton!
    @IBOutlet weak var playBtn: UIButton!
    // 常用句按钮
    @IBOutlet weak var healthyBtn: UIButton!
    @IBOutlet weak var shopBtn: UIButton!
    @IBOutlet weak var dailyBtn: UIButton!
    @IBOutlet weak var hobbyBtn: UIButton!
    
    
    @IBOutlet weak var chooseShadowBtn: UIButton!
    @IBOutlet weak var toneBtn: UIButton!
    @IBOutlet weak var decorationBtn: UIButton!
    @IBOutlet weak var relationBtn: UIButton!
    @IBOutlet weak var sportBtn: UIButton!
    @IBOutlet var wordCollectionView: UICollectionView!
    
    // 撤回操作
    var dataHistory = Stack<String>()
    var colorHistory = Stack<Int>()
    
    @IBOutlet weak var shadowCover: UIView!
    @IBOutlet weak var floatWindow: UIView!
    @IBOutlet weak var needHelp: UIButton!
    public var step = 0
    var chooseWord = ""
    @IBOutlet weak var maskLabelView: UIView!
    @IBOutlet weak var keyWordsCollectionView: UICollectionView!
    @IBOutlet var mention: UILabel!
    @IBOutlet weak var outerView: UIView!
    @IBOutlet weak var descriptionCollectionView: UICollectionView!
    @IBOutlet weak var DescriptionView: UIView!
    @IBOutlet var chooseWordCollectionView: UICollectionView!
    @IBOutlet weak var searchView: UIView!
    @IBOutlet weak var lastStep: UIButton!
    @IBOutlet weak var backtoTop: UIButton!
    var panGesture = UIPanGestureRecognizer()
    var showMention = false
    var chooseWordsData = ["厨师","巧克力","红烧肉","脂肪肝","炸鸡","出汗","健身教练","吃"]
    var descriptionData = ["有什么特征","出现的地点","出现的时间","发生的行为","关联的事件","相关的人","相关的事物"]
    var chooseWordsRow:Int = 0
    let descriptionRow:Int = 0
//    let shouldGoon = []
    
    var keywordsData = [String]()
    let mentionData = [["嗨！我可以根据您的选择，帮助您查找「目标词」。\n\n您会从以下哪方面来描述这一「目标词」呢？"],
                       ["您要描述什么的特征？","您要描述什么地点？","您要描述什么时间？","您要描述怎样的行为？","您要描述的是什么事件？","您要从哪方面描述相关的人？","您要描述什么事物？"],
                       ["您要从以下哪个方面描述这个人呢？","您要从以下哪个方面描述这个行为呢？","您要从以下哪个方面描述这个事物呢？","","","","","这个职业是什么？","人际关系是什么？","这个饮食是什么？","这个医疗健康是什么？","这个生活用品是什么？","这个文娱产品是什么？","这个身体是什么？","这个交通工具是什么？","这个家居是什么？","这个服饰是什么？","这个动植物是什么？","这个天气是什么？"],
                       ["这个人的年龄是什么？","这个人的品质性格是什么？","这个人的体型身材是什么？","这个人的性别是什么？","这个行为的程度如何？","这个行为的速度如何？","这个事物的材质如何？","这个事物的体积大小如何？","这个事物的温度情况如何？","这个事物的形状如何？","这个事物的颜色如何？","这个事物的重量如何？","这个事物的状态如何？"],
                       ["您已选择“胖”，上面有您要找的词吗？\n\n也可以试试返回后从其他维度增加描述哦"]]
    
    let totalData = [[["有什么特征","出现的地点","出现的时间","发生的行为","关联的事件","相关的人","相关的事物"]],
                     [["人的特征","行为的特征","事物的特征"],["上课", "下水道", "书房", "交通", "公司", "公园", "农田", "办公室", "化妆", "医院", "卧室", "卫生间", "厕所", "厨房", "吃饭", "商场", "嘴", "图书馆", "地面", "学校", "客厅", "室内", "家", "小区", "工位", "工作单位", "市场", "户外", "房间", "按摩", "教室", "旅行", "果园", "森林", "水果店", "江河", "汽车", "沙发", "浴室", "海边", "甜品", "电影院", "社区", "花园", "药店", "衣柜", "超市", "路边", "运动场", "酒吧", "酒店", "锻炼", "门", "音乐", "食堂", "餐厅", "餐桌"]
,["上课", "下午", "下午茶", "下班", "下雨", "中午", "丰收", "买菜", "亲戚", "休息", "住院", "假期", "做饭", "健身", "冬天", "出门", "午餐", "危险", "受伤", "吃药", "吃饭", "唱歌", "回家", "夏天", "天气", "学习", "客人", "少年", "工作", "市场", "幼年", "康复", "开会", "成长", "手术", "按摩", "搬家", "整理", "旅行", "日常", "早晨", "早餐", "春天", "晚上", "晚餐", "晴天", "洗", "洗漱", "洗澡", "点菜", "烧烤", "烹饪", "玩耍", "生病", "生育", "电影", "电视", "白天", "看病", "睡觉", "秋天", "种植", "突然", "童年", "结婚", "维修", "老人", "聊天", "聚会", "购买", "超市", "跑步", "跳舞", "过节", "逛街", "锻炼", "难受", "青年", "食物", "饭后"]
,["上楼", "上班", "上课", "下楼", "买菜", "亲戚", "休息", "作业", "做饭", "写", "出门", "刷", "吃饭", "回家", "学习", "工作", "广场舞", "康复", "开会", "开车", "成长", "手术", "打扫", "打招呼", "拿", "接送", "搬运", "整理", "旅行", "森林", "治疗", "洗漱", "洗碗", "洗衣服", "游戏", "照顾", "玩耍", "电影", "看病", "社交", "红包", "结婚", "维修", "考试", "聊天", "聚会", "表达", "读书", "走", "躺", "车", "辅导", "逛街", "遛狗", "锻炼", "陪伴", "骑车"]
,["上班", "下班", "丰收", "亲戚", "休息", "住院", "做饭", "健身", "出门", "办公", "化妆", "发烧", "受伤", "变质", "吃药", "吃饭", "学习", "客人", "家", "工作", "庆祝", "康复", "开会", "怀孕", "成长", "手术", "打扫", "拍照", "掉落", "放松", "整理", "旅行", "比赛", "治疗", "洗", "洗漱", "洗澡", "洗衣服", "游戏", "照顾", "玩耍", "生病", "生育", "电视", "看病", "睡觉", "社交", "穿戴", "约会", "结婚", "考试", "聚会", "装修", "读书", "购买", "走", "起床", "跳舞", "车祸", "过节", "锻炼", "饿", "骑车"]
,["职业","人际关系"],["饮食","医疗健康","生活用品","文娱产品","身体部位","交通工具","家居","服饰","动植物","天气情况"]],
                     [["年龄","品质性格","体型身材","性别"],["程度","速度"],["材质","体积大小","温度情况","形状","颜色","重量","状态"],[""],[""],[""],[""],["中医", "主妇", "保姆", "保安", "农民", "医生", "厨师", "司机", "员工", "售货员", "商场", "天气", "学生", "客人", "家庭主妇", "小贩", "工人", "护士", "护工", "搬家", "教授", "教练", "服务员", "森林", "模特", "歌手", "渔民", "爷爷", "物业", "理发师", "甜品", "白领", "科学家", "经理", "老师", "老板", "营养", "设计师", "运动员", "配送员", "销售员", "锻炼"],["亲戚", "侄女", "侄子", "保姆", "儿子", "兄弟", "叔叔", "同事", "同学", "女", "女儿", "女朋友", "妈妈", "姐妹", "嫂子", "学生", "孩子", "客人", "室友", "家人", "弟妹", "弟弟", "晚辈", "朋友", "爷爷", "爸爸", "病人", "祖母", "祖父", "老人", "老师", "邻居", "阿姨", "青年"],["下午茶", "中餐", "主食", "午餐", "吃饭", "咖啡", "外卖", "奶粉", "开水", "早餐", "晚餐", "果汁", "水", "水果", "汤", "沙拉", "油", "泡面", "火锅", "点心", "烧烤", "牛奶", "牛排", "瓜子", "甜品", "粉丝", "粥", "糖", "纯净水", "肉", "能量", "苹果", "茶", "菜", "营养", "蔬菜", "西瓜", "西餐", "豆腐", "辅食", "辣", "酒", "零食", "面条", "面粉", "食物", "饭", "骨头", "鱼", "鸡蛋"]
,["中医", "中暑", "中毒", "中风", "健身", "儿科", "冰敷", "减肥", "医疗器械", "发烧", "受伤", "呕吐", "妇科", "康复", "手", "手术", "打点滴", "打针", "担架", "拐杖", "按摩", "消化", "照顾", "牙齿", "生病", "病房", "病毒", "看病", "糖", "糖尿病", "美容", "老年病", "脑卒中", "药", "营养", "轮椅", "过敏", "近", "针灸", "阿尔兹海默症", "风湿病", "驼背", "骨折", "骨质疏松", "高血压"]
,["伞", "冰箱", "刀", "刷", "勺子", "化妆", "化妆品", "卫生巾", "叉子", "口罩", "吸管", "床", "开水", "微波炉", "手机", "手表", "抹布", "拐杖", "插头", "有电", "望远镜", "杯子", "枕头", "桌子", "椅子", "榨汁", "毛巾", "水", "水壶", "水龙头", "沐浴露", "洗", "洗衣服", "洗衣粉", "热水器", "牙刷", "牙膏", "瓶子", "电线", "电脑", "盆", "盒子", "盘子", "眼镜", "碗", "筷子", "纸", "纸尿裤", "美容", "老人机", "耳机", "花", "药", "衣架", "被子", "车", "轮椅", "锅", "锅铲", "锻炼", "镜子", "防晒霜", "音响", "餐具", "餐桌", "香水", "香皂"]
,["上网", "上课", "乐器", "书本", "书法", "作业", "健身", "动画片", "卡通", "吃饭", "唱歌", "围棋", "天气", "广告", "广场舞", "戏曲", "收音机", "文学", "旅行", "望远镜", "桌游", "比赛", "游戏", "漫画", "玩具", "玩耍", "电影", "电脑", "电视", "电视机", "童话", "红包", "舞蹈", "视频", "诗歌", "读", "象棋", "走", "跳舞", "过节", "逛街", "遛狗", "钓鱼", "钢琴", "锻炼", "音乐", "音响"]
,["嘴", "头", "头发", "小腿", "屁股", "手", "手机", "手表", "牙齿", "电脑", "皮肤", "眼睛", "耳朵", "肌肉", "肚子", "胃", "胳膊", "胸部", "脑袋", "脖子", "脚", "脸", "腰", "腿", "舌头", "身体", "鼻子"]
,["交通", "地铁", "救护车", "椅子", "汽车", "火车", "电动车", "自行车", "船", "超市", "车", "轮椅", "飞机"]
,["冰箱", "凳子", "家具", "床", "微波炉", "手机", "按摩", "插头", "收音机", "枕头", "柜子", "桌子", "椅子", "榨汁", "水龙头", "沙发", "洗", "洗衣机", "游戏", "烘干机", "烤箱", "热水器", "牙刷", "玻璃", "电脑", "电视", "电视机", "空调", "美容", "茶几", "衣架", "衣柜", "被子", "镜子", "门", "鞋子", "音响", "餐桌"]
,["上衣", "丝袜", "伞", "内衣", "制服", "口罩", "围裙", "外套", "枕头", "毛巾", "眼镜", "腰带", "衣服", "衬衫", "袜子", "被子", "装饰", "裙子", "裤子", "鞋子"]
,["兔子", "叶子", "小麦", "树", "水果", "牛", "猪", "猫", "玫瑰", "病毒", "病菌", "盆栽", "竹子", "粉末", "花", "苹果", "茶", "营养", "蔬菜", "虫子", "西瓜", "鱼", "鸟", "鸡"]
,["下雨", "光", "冬天", "冷", "凉爽", "台风", "夏天", "太阳", "春天", "晴天", "暖", "暴雨", "热", "秋天", "空气"]
,[""]],
                     [["中年", "少年", "幼年", "成年", "童年", "老人", "青年"],["严肃", "乖巧", "光", "努力", "勇敢", "勤劳", "可爱", "听话", "唠叨", "善良", "固执", "坚强", "坚硬", "大方", "天真", "好奇", "幽默", "开放", "开朗", "慈祥", "懒散", "成熟", "抠门", "暖", "活泼", "温柔", "漂亮", "热心", "热情", "直率", "粗暴", "细", "耐心", "聪明", "能干", "脆弱", "腼腆", "苦", "认真", "调皮", "青年", "高贵", "魅力"]
,["瘦", "矮", "胖", "脆弱", "驼背", "高"],["女", "男"],["努力", "多", "少", "干净", "浅", "深", "清新", "用力", "粗略", "臭", "认真", "轻", "轻松", "远", "重", "饿"]
,["快", "慢"],["光", "光滑", "坚硬", "塑料", "多汁", "奶粉", "嫩", "布料", "干", "弹性", "木头", "柔软", "棉", "橡胶", "毛线", "水", "水果", "水泥", "油", "混凝土", "清新", "湿", "滑", "潮湿", "牛仔", "牛奶", "玻璃", "电线", "硬", "竹子", "粗糙", "粘稠", "糖", "纸", "肉", "肌肉", "脆", "脆弱", "舒服", "营养", "薄", "血管", "软", "轻", "轻松", "透明", "重", "金属", "陶瓷", "面粉", "骨头"]
,["大", "宽", "宽敞", "小", "手", "拥挤", "正常", "瘦", "短", "矮", "窄", "粗", "细", "胖", "脆弱", "长", "高"],["体温", "冰", "冷", "凉", "凉爽", "暖", "温度", "烫", "热", "舒服"],["叶子", "圆形", "块状", "宽", "弯曲", "方形", "条状", "柱状", "片状", "球形", "瘦", "盆", "盒子", "短", "粉末", "粗", "细", "胖", "腿", "薄", "轻", "长", "鸟"]
,["光", "彩色", "斑点", "无色", "棕色", "橙色", "深色", "灰色", "白色", "粉色", "紫色", "红色", "绿色", "肉色", "蓝色", "透明", "银色", "青色", "黄色", "黑色"]
,["正常", "瘦", "肥", "胖", "轻", "轻松", "重"],["严肃", "休息", "健康", "光", "光滑", "关闭", "危险", "发热", "可爱", "呕吐", "固体", "大", "安静", "干", "干净", "开放", "快", "恶心", "慢", "成熟", "手", "打开", "折叠", "拥挤", "拿", "放", "放松", "故障", "新", "新鲜", "旧", "晴天", "有电", "正常", "死", "油", "泡沫", "活泼", "流动", "液体", "清新", "湿", "满", "漂亮", "潮湿", "烫", "热", "热情", "熟", "生", "生病", "疼痛", "痛", "白色", "空", "穿戴", "系紧", "脆弱", "脏", "脱下", "舒服", "轻松", "阴", "难受", "高贵"],[""],[""],[""],[""],[""],[""],[""]]
    ]
    var history = [Int]()
    var chooseWordsDict:[String:[String]] = ["小":["T恤", "下巴", "充电器", "公园", "凉鞋", "出租车", "刀子", "剃须刀", "勺子", "包子", "医院", "南瓜", "卫衣", "厨房", "叉子", "发卡", "发箍", "口红", "口罩", "口袋", "叶子", "吹风机", "咖啡", "嘴巴", "土豆", "头发", "巧克力", "帽子", "平底锅", "平板电脑", "开塞露", "扇贝", "手机", "抽屉", "指甲", "杯子", "枕头", "果汁", "柠檬", "树", "树林", "树枝", "桌子", "梨", "椅子", "樱桃", "橙子", "毛巾", "水", "汽水", "沐浴露", "洗发露", "洗手池", "洗面奶", "浴室", "淤青", "灯", "煮锅", "牙刷", "牙膏", "牙齿", "牛奶", "狗", "猫", "玉米", "电梯", "皮鞋", "眼镜", "碗", "秒钟", "窗边", "笔", "笔记本", "筷子", "米饭", "糖果", "纸", "纸巾", "羊肉", "老鼠", "耳机", "肥皂", "背心", "胶囊", "胸", "脚", "腰", "花", "苍蝇", "茄子", "茶", "药", "药片", "药膏", "菠菜", "葡萄", "蘑菇", "虫", "虾", "蚂蚁", "蚊子", "蛋黄", "螃蟹", "蟑螂", "袖子", "袜子", "西兰花", "豆角", "轮椅", "运动鞋", "通心粉", "酒", "酸奶", "镜子", "长裤", "青椒", "青菜", "面包", "面条", "鞋带", "风", "餐巾", "饼干", "馒头", "香肠", "香菜", "香蕉", "鱼", "鱼肉", "鸟", "鸡肉", "鸡蛋", "鸭肉", "黄瓜", "鼻子"],
                                             "穿戴":["T恤", "T恤", "内衣", "凉鞋", "凉鞋", "出门", "卫衣", "卫衣", "去医院", "发卡", "发卡", "发箍", "发箍", "口罩", "口罩", "墨镜", "外套", "大衣", "帽子", "帽子", "手套", "手套", "拖鞋", "拖鞋", "毛衣", "皮鞋", "眼镜", "眼镜", "睡衣", "短裤", "秋衣", "穿鞋", "背心", "胸", "胸罩", "衬衣", "袖子", "袜子", "袜子", "裙子", "运动鞋", "长裤", "长裤", "靴子", "靴子", "鞋带", "领带"],
                                             "拿":["T恤", "充电器", "吹风机", "商店", "墨镜", "快递员", "手", "手写板", "拿", "捡", "柠檬", "梨", "樱桃", "橙子", "洗脚盆", "猫", "玉米", "笔", "筷子", "胳膊", "脸盆", "花", "花瓶", "茶", "菜市场", "蟑螂", "银行", "门口", "鸡蛋"],
                                             "商场":["T恤", "内衣", "口红", "售货员", "售货员", "外套", "大衣", "快递员", "服务员", "毛衣", "洋葱", "清洁工", "火龙果", "牛油果", "生姜", "番茄", "白菜", "白萝卜", "短裤", "背心", "胡萝卜", "芒果", "苹果", "裙子"],
                                             "夏天":["T恤", "凉鞋", "南瓜", "可乐", "墨镜", "夏季", "太阳", "季节", "帽子", "星星", "晴天", "月亮", "沐浴露", "生姜", "短裤", "空调", "空调", "背", "背心", "胳膊", "腿", "草", "袖子", "西瓜", "雨", "雨天", "雷电", "风扇", "风扇"],
                                             "布料":["T恤", "口罩", "口袋", "帽子", "床单", "枕头", "毛巾", "毛毯", "沙发", "窗边", "长裤"],
                                             "舒服":["T恤", "凉鞋", "卫衣", "地毯", "拖鞋", "拖鞋", "按摩", "春季", "毛毯", "沙发", "浴室", "秋季", "空调", "窗边", "窗边", "背心", "胸", "脖子", "脚", "风扇", "鼻子"],
                                             "售货员":["T恤", "南瓜", "可乐", "吹风机", "商店", "土豆", "墨镜", "巧克力", "枕头", "果汁", "柠檬", "梨", "樱桃", "橙子", "毛巾", "毛毯", "水", "汽水", "沐浴露", "洗发露", "洗面奶", "牙刷", "牙膏", "牛奶", "牛肉", "猪肉", "玉米", "皮鞋", "背心", "药店", "虾", "螃蟹", "酒", "酸奶", "鸡蛋"],
                                             "胳膊":["T恤", "手肘", "手腕", "抱", "推", "摇", "白萝卜", "蚊子", "血压仪", "袖子", "鸟"],
                                             "身体":["T恤", "上班", "休息", "公园", "午睡", "卫衣", "外套", "大衣", "工作", "广场", "床", "推", "毛巾", "毛毯", "毛衣", "沐浴露", "洗澡", "浴室", "浴缸", "淤青", "瘙痒", "睡衣", "睡觉", "秋衣", "穿衣服", "背心", "胳膊", "脚", "腰", "药膏", "衬衣", "袖子", "被子", "裙子", "锻炼", "高肌张力"],
                                             "轻":["T恤", "下巴", "低头", "充电器", "内衣", "凉鞋", "勺子", "南瓜", "卫衣", "叉子", "发卡", "发箍", "口红", "口罩", "口袋", "叶子", "后退", "吹", "吹风机", "咬", "嘴巴", "围巾", "土豆", "地毯", "墨镜", "头发", "头绳", "帽子", "平板电脑", "床单", "开塞露", "弯腰", "扇贝", "手套", "打", "扶", "抬头", "抱", "抽屉", "拍", "拖鞋", "拿", "指甲", "按", "捡", "推", "插", "摇", "摇头", "撕", "擦", "敲", "枕头", "柠檬", "树枝", "樱桃", "樱桃", "毛巾", "毛毯", "水", "沐浴露", "洋葱", "洗发露", "洗脚盆", "洗面奶", "火龙果", "灯", "点头", "牙刷", "牙刷", "牙膏", "牛油果", "牛肉", "狗", "猪肉", "猫", "玉米", "生姜", "番茄", "眼镜", "睡衣", "睡觉", "短裤", "秋衣", "秒钟", "笔", "笔记本", "笔记本电脑", "筷子", "米饭", "糖果", "纸", "纸巾", "羊肉", "老鼠", "耳机", "背心", "背心", "背心", "胡萝卜", "胶囊", "胸罩", "脸盆", "自行车", "芒果", "花", "苹果", "茄子", "草", "药片", "菠菜", "葡萄", "蘑菇", "虾", "蚊子", "蛋黄", "螃蟹", "蟑螂", "衬衣", "袖子", "袖子", "袜子", "西兰花", "豆角", "蹲下", "躺下", "转身", "轮椅", "进", "通心粉", "镜子", "长裤", "雨", "雨天", "雪", "青椒", "青菜", "面包", "鞋带", "领带", "风扇", "餐巾", "饼干", "馒头", "香肠", "香菜", "香蕉", "鱼", "鱼肉", "鸟", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "怀孕":["丈夫", "叔叔", "妻子", "婶婶", "舅妈", "舅舅", "阿姨"],
                                             "结婚":["丈夫", "丈夫", "儿子", "儿子", "兄弟", "叔叔", "女人", "女儿", "女儿", "女儿", "妻子", "妻子", "妻子", "姐妹", "婶婶", "舅妈", "舅舅", "阿姨"],
                                             "儿子":["丈夫", "凉鞋", "剃须刀", "卫衣", "吃药", "喝水", "妻子", "家人", "帽子", "平板电脑", "手机", "桌子", "椅子", "沙发", "浴缸", "火龙果", "灯", "牛油果", "玩手机", "电脑", "电视机", "白菜", "白萝卜", "皮鞋", "窗户", "笔记本电脑", "胡萝卜", "芒果", "苹果", "茶几", "起床", "运动鞋", "镜子", "门", "马桶", "鱼"],
                                             "女儿":["丈夫", "凉鞋", "卫衣", "发卡", "发箍", "吃药", "喝水", "头绳", "妻子", "家人", "帽子", "平板电脑", "手机", "桌子", "椅子", "沙发", "浴缸", "火龙果", "灯", "牛油果", "玩手机", "生姜", "电脑", "电视机", "白菜", "白萝卜", "窗户", "笔记本电脑", "胡萝卜", "芒果", "苹果", "茶几", "蟑螂", "起床", "运动鞋", "镜子", "门", "马桶", "鱼"],
                                             "妈妈":["丈夫", "上午", "中午", "保姆", "停车场", "儿子", "兄弟", "公园", "冰箱", "凉鞋", "刀子", "勺子", "包子", "医院", "南瓜", "卫衣", "厨房", "去医院", "发卡", "发箍", "叔叔", "口红", "口罩", "口袋", "吃药", "同学", "喝水", "回家", "围巾", "土豆", "墨镜", "外公", "外婆", "头绳", "女人", "女儿", "女孩", "姐妹", "婶婶", "学生", "家", "家人", "小孩", "工作", "巧克力", "帽子", "平底锅", "平板电脑", "年轻人", "床单", "微波炉", "手套", "手机", "打电话", "桌子", "椅子", "沙发", "洋葱", "洗衣机", "浴缸", "火龙果", "灯", "煮锅", "父亲", "牛油果", "牛肉", "猪肉", "玉米", "玩手机", "生姜", "电脑", "电视机", "番茄", "白菜", "白萝卜", "秋衣", "空调", "窗户", "笔记本电脑", "胡萝卜", "舅妈", "舅舅", "芒果", "苹果", "茶几", "虾", "螃蟹", "蟑螂", "说话", "起床", "镜子", "长裤", "门", "阴天", "阿姨", "面条", "风扇", "马桶", "鱼", "鸡蛋"],
                                             "孩子":["丈夫", "上午", "下午", "中午", "中药", "保姆", "儿子", "冬季", "包子", "医院", "发烧", "可乐", "司机", "头痛", "女儿", "女孩", "巧克力", "感冒", "果汁", "柠檬", "树", "树林", "树枝", "梨", "樱桃", "橙子", "水", "汽水", "洋葱", "淤青", "牙刷", "牙膏", "牙齿", "牛奶", "狗", "猫", "玉米", "瘙痒", "窗边", "胃痛", "胶囊", "药", "药片", "虾", "蚂蚁", "螃蟹", "邻居", "酒", "酸奶", "阴天", "面条", "高肌张力", "鸟", "鸡蛋"],
                                             "爸爸":["丈夫", "上午", "中午", "保姆", "停车场", "儿子", "兄弟", "公园", "冰箱", "凉鞋", "刀子", "剃须刀", "勺子", "医院", "卫衣", "厨房", "去医院", "发卡", "发箍", "叔叔", "口罩", "口袋", "叶子", "吃药", "同学", "喝水", "回家", "围巾", "墨镜", "头绳", "女人", "女儿", "女孩", "奶奶", "姐妹", "姑姑", "姑父", "婶婶", "学生", "家", "家人", "小孩", "工作", "巧克力", "帽子", "平底锅", "平板电脑", "年轻人", "微波炉", "手机", "打电话", "桌子", "椅子", "母亲", "沙发", "洋葱", "洗衣机", "浴缸", "火龙果", "灯", "煮锅", "爷爷", "牛油果", "玩手机", "生姜", "电脑", "电视机", "白菜", "白萝卜", "皮鞋", "秋衣", "空调", "窗户", "笔记本电脑", "背心", "胡萝卜", "舅妈", "舅舅", "芒果", "苹果", "茶几", "蟑螂", "说话", "起床", "运动鞋", "镜子", "长裤", "门", "阿姨", "面条", "风扇", "马桶", "鱼"],
                                             "懒散":["丈夫", "侄女", "侄子", "叔叔", "同学", "外甥", "外甥女", "学生", "年轻人", "舅舅"],
                                             "温柔":["丈夫", "叔叔", "女人", "妻子", "姐妹", "姑父", "婶婶", "护士", "护工", "朋友", "母亲", "理疗师", "社工", "老师", "舅妈", "舅舅", "阿姨"],
                                             "粗暴":["丈夫", "叔叔", "舅舅"],
                                             "能干":["丈夫", "保姆", "母亲"],
                                             "家":["丈夫", "中药", "侄女", "侄子", "保姆", "儿子", "兄弟", "充电器", "公园", "内衣", "刷牙", "剃须刀", "医院", "午睡", "厨房", "去医院", "叔叔", "可乐", "吃", "吃药", "吃饭", "吸", "吹风机", "回家", "地毯", "外公", "外公", "外婆", "外婆", "外甥", "外甥女", "头痛", "女人", "女儿", "女孩", "奶奶", "奶奶", "妻子", "姐妹", "姑姑", "姑父", "婶婶", "客厅", "床", "感冒", "打电话", "护工", "抱", "抽屉", "杯子", "果汁", "柜子", "柠檬", "桌子", "梨", "椅子", "樱桃", "橙子", "母亲", "毛巾", "毛毯", "水", "汽水", "沙发", "洗手池", "洗澡", "洗脸", "洗面奶", "浴缸", "淤青", "灯", "父亲", "牛奶", "牛肉", "狗", "猪肉", "猫", "玉米", "玩手机", "电梯", "电脑", "电视机", "瘙痒", "看书", "看电视", "睡衣", "睡觉", "短裤", "秋衣", "空调", "穿衣服", "穿鞋", "窗户", "窗边", "笔", "笔记本", "纸", "胃痛", "背心", "胶囊", "脚", "舅妈", "舅舅", "芒果", "花瓶", "苹果", "茶", "茶几", "茶壶", "药", "药片", "药膏", "蟑螂", "衬衣", "袖子", "被子", "裙子", "视频", "说话", "起床", "酒", "酸奶", "镜子", "门", "门口", "阳台", "阿姨", "面条", "风扇", "马桶", "高肌张力", "鸡蛋"],
                                             "男":["丈夫", "侄子", "儿子", "兄弟", "叔叔", "外公", "外甥", "姑父", "快递员", "父亲", "爷爷", "男人", "男孩", "舅舅"],
                                             "上班":["丈夫", "上午", "下午", "出门", "叔叔", "头绳", "女人", "妻子", "婶婶", "母亲", "父亲", "皮鞋", "背包", "舅妈", "舅舅", "走", "起床", "邻居", "阿姨"],
                                             "工作":["丈夫", "儿子", "叔叔", "咖啡", "头痛", "女人", "女人", "女儿", "妻子", "婶婶", "年轻人", "母亲", "水", "父亲", "电脑", "电脑", "眼镜", "眼镜", "笔记本电脑", "笔记本电脑", "脖子", "舅妈", "舅舅", "视频", "阿姨"],
                                             "照顾":["丈夫", "保姆", "儿子", "儿子", "兄弟", "外公", "外公", "外公", "外婆", "外婆", "外婆", "女人", "女儿", "女儿", "女孩", "奶奶", "奶奶", "奶奶", "妻子", "姐妹", "姑姑", "家人", "扶", "护士", "护工", "护理中心", "护理中心", "母亲", "父亲", "爷爷", "爷爷", "社工"],
                                             "家人":["上午", "中午", "中药", "停车场", "充电器", "冬季", "包子", "医生", "南瓜", "发烧", "可乐", "司机", "土豆", "头痛", "姐妹", "姑姑", "姑父", "客厅", "家", "感冒", "护工", "护理中心", "枕头", "果汁", "柠檬", "树", "树林", "桌子", "梨", "椅子", "楼梯", "樱桃", "橙子", "毛巾", "毛毯", "水", "汽水", "沐浴露", "沙发", "洗发露", "洗手池", "洗面奶", "浴室", "浴缸", "淤青", "灯", "牙刷", "牙膏", "牛奶", "牛肉", "狗", "猪肉", "猫", "玉米", "电梯", "瘙痒", "碗", "窗户", "胃痛", "胶囊", "茄子", "茶几", "药", "药片", "药膏", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "螃蟹", "血糖仪", "西兰花", "西瓜", "豆角", "酒", "酸奶", "镜子", "门", "门口", "阳台", "阴天", "雾", "青椒", "青菜", "风", "马桶", "鸡蛋"],
                                             "吃饭":["上午", "中午", "中药", "公园", "冰箱", "出门", "勺子", "包子", "南瓜", "厨房", "可乐", "咬", "嚼", "土豆", "姐妹", "家人", "微波炉", "微波炉", "朋友", "朋友", "服务员", "果汁", "柠檬", "桌子", "梨", "椅子", "樱桃", "橙子", "水", "汽水", "沙发", "洋葱", "火龙果", "煮锅", "煮锅", "牛奶", "牛油果", "牛油果", "生姜", "番茄", "番茄", "白菜", "白菜", "白萝卜", "白萝卜", "皮鞋", "碗", "碗", "筷子", "胡萝卜", "胡萝卜", "胶囊", "腹部", "芒果", "苹果", "茶", "茶几", "药", "药片", "菠萝", "葡萄", "虾", "螃蟹", "西瓜", "走", "郊外", "酒", "酸奶", "面条", "餐巾", "餐巾", "鱼", "鸡蛋", "鼻子"],
                                             "开会":["上午", "刷牙", "皮鞋", "老师", "视频"],
                                             "洗漱":["上午", "护工", "毛巾", "沐浴露", "洗发露", "洗手池", "浴室", "浴缸", "灯", "牙刷", "牙膏", "镜子", "马桶"],
                                             "毛巾":["上午", "沐浴露", "洗发露", "洗澡", "洗脚盆", "洗脸", "洗面奶", "浴室", "浴缸", "纸巾", "脸盆", "镜子", "马桶"],
                                             "牙刷":["上午", "刷牙", "刷牙", "浴室", "牙齿"],
                                             "农民":["上午", "南瓜", "叶子", "土豆", "树", "树林", "树枝", "洋葱", "火龙果", "牛油果", "玉米", "生姜", "番茄", "白菜", "白萝卜", "羊肉", "胡萝卜", "芒果", "苹果", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "蛋黄", "西兰花", "西瓜", "豆角", "青椒", "青菜", "香肠", "香菜", "香蕉", "鱼", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "员工":["上午", "下午", "中午", "外卖员", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "牛奶", "玩手机", "皮鞋", "视频", "酒", "酸奶", "银行"],
                                             "老师":["上午", "写", "同学", "学校", "学生", "手写板", "敲", "果汁", "梨", "樱桃", "橙子", "水", "汽水", "牛奶", "画", "眼镜", "眼镜", "胡萝卜", "茶", "视频", "酒", "酸奶", "馒头"],
                                             "早餐":["上午", "包子", "楼梯", "蛋黄", "起床", "闻", "面包"],
                                             "牛奶":["上午", "儿子", "女儿", "女孩", "巧克力", "杯子", "玉米", "蛋糕", "酸奶", "酸奶", "面包"],
                                             "鸡蛋":["上午", "打", "牛油果", "面条"],
                                             "厕所":["上厕所", "剃须刀", "吹风机", "毛巾", "洗手池", "洗衣机", "洗面奶", "浴缸", "牙刷", "牙膏", "肥皂", "蹲下", "镜子", "马桶"],
                                             "多":["上厕所", "吃", "吃药", "吃饭", "吸", "喝水", "学习", "玩手机", "说话"],
                                             "少":["上厕所", "去医院", "吃", "吃药", "吃饭", "吸", "喝水", "回家", "学习", "玩手机", "说话"],
                                             "屁股":["上厕所", "拍", "椅子", "沙发", "马桶"],
                                             "腿":["上厕所", "上班", "休息", "出门", "午睡", "屁股", "工作", "捡", "桌子", "椅子", "楼梯", "沙发", "洗澡", "睡觉", "矫正板", "胳膊", "药膏", "蚊子", "街", "走", "跑", "踢", "轮椅", "锻炼", "长裤"],
                                             "快":["上厕所", "低头", "写", "出租车", "分钟", "刷牙", "剪", "去医院", "吃", "吃饭", "后退", "吞", "吸", "吹", "咬", "喝", "喝水", "嚼", "回家", "学习", "工作", "弯腰", "打电话", "扶", "抓", "抬头", "抱", "拍", "拿", "捡", "推", "摇头", "撕", "敲", "洗澡", "洗脸", "点头", "玩手机", "看书", "睡觉", "穿衣服", "穿鞋", "蚂蚁", "说话", "走", "起床", "跑", "踢", "蹲下", "躺下", "转身", "进"],
                                             "慢":["上厕所", "低头", "写", "出租车", "剪", "去医院", "吃", "吃饭", "后退", "吸", "吹", "喝水", "嚼", "回家", "学习", "工作", "打电话", "扶", "抓", "抬头", "抱", "拿", "捡", "推", "摇头", "撕", "擦", "敲", "洗澡", "看书", "睡觉", "穿鞋", "站", "蚂蚁", "说话", "走", "起床", "转身", "进"],
                                             "地铁":["上班", "出门", "分钟", "去医院", "回家", "女人", "姐妹", "学校", "家", "手机"],
                                             "汽车":["上班", "中午", "书店", "停车场", "公园", "出门", "分钟", "医院", "去医院", "回家", "外公", "外婆", "女人", "奶奶", "妻子", "姐妹", "家", "工作", "扶", "桌子", "椅子", "沙发", "灯", "空调", "窗户", "窗边", "羊肉", "耳机", "蛋黄", "路", "镜子", "门", "雾", "香肠", "香菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "自行车":["上班", "中午", "书店", "儿子", "公园", "出门", "去医院", "回家", "外套", "女儿", "女孩", "学校", "灯", "男孩", "老人", "脚", "腿", "路"],
                                             "车":["上班", "书店", "儿子", "出门", "女儿", "女孩", "小孩", "打", "护士", "护工", "擦", "酒"],
                                             "办公室":["上班", "休息", "充电器", "冰箱", "午睡", "工作", "平板电脑", "微波炉", "手写板", "电脑", "空调", "笔记本电脑", "糖果", "耳机", "茶", "视频", "风扇"],
                                             "制服":["上班", "工作", "衬衣"],
                                             "手机":["上班", "下午", "中午", "低头", "充电器", "分钟", "女人", "妻子", "工作", "快递员", "打电话", "擦", "擦", "玩手机", "玩手机", "电梯", "视频", "视频"],
                                             "电脑":["上班", "下午", "中午", "分钟", "女人", "女人", "妻子", "家", "家", "工作", "手写板", "敲", "玩手机", "老师", "耳机", "视频", "视频"],
                                             "认真":["上班", "剪", "同学", "售货员", "姐妹", "婶婶", "学习", "学生", "护工", "擦", "朋友", "服务员", "父亲", "玩手机", "男孩", "画", "看", "看书", "穿衣服", "维修工", "老师", "说话", "阿姨"],
                                             "手":["上班", "书店", "书架", "休息", "冰箱", "刀子", "刷牙", "勺子", "午睡", "叉子", "口红", "口红", "吃饭", "吸", "学习", "工作", "平底锅", "平板电脑", "微波炉", "手", "手写板", "手套", "手指", "手机", "打电话", "扶", "扶", "抓", "抱", "抱", "抽屉", "拍", "拿", "拿", "指甲", "捡", "推", "推", "撕", "杯子", "果汁", "柜子", "柠檬", "桌子", "梨", "樱桃", "橙子", "水", "汽水", "洋葱", "洋葱", "洗手池", "洗澡", "洗脚盆", "洗脸", "洗衣机", "火龙果", "牙刷", "牙膏", "牛奶", "牛油果", "牛油果", "玩手机", "生姜", "电脑", "电视机", "番茄", "番茄", "白菜", "白萝卜", "看书", "睡觉", "碗", "空调", "穿衣服", "穿鞋", "笔", "笔记本", "笔记本电脑", "筷子", "纸", "纸巾", "羊肉", "肥皂", "胡萝卜", "胳膊", "脖子", "脚", "脸盆", "芒果", "花瓶", "苹果", "苹果", "茶", "茶几", "茶壶", "菜市场", "蚊子", "蛋黄", "血糖仪", "酒", "酸奶", "银行", "锻炼", "门", "门口", "风扇", "餐巾", "香肠", "香菜", "香蕉", "鱼肉", "鸟", "鸡肉", "鸭肉", "黄瓜"],
                                             "脑袋":["上班", "休息", "午睡", "工作", "睡觉"],
                                             "学生":["下午", "写", "打电话", "敲", "玩手机", "玩手机", "眼镜", "老师", "肩", "背包", "视频"],
                                             "老人":["下午", "兄弟", "医院", "去医院", "吃药", "售货员", "喝水", "外公", "外婆", "女人", "奶奶", "妻子", "姐妹", "姑姑", "姑父", "家人", "年轻人", "康复训练", "护理中心", "护理中心", "按摩", "朋友", "服务员", "母亲", "清洁工", "父亲", "爷爷", "牙齿", "理疗师", "理疗师", "男人", "社工", "窗边", "维修工", "老人", "老师", "脚", "腿", "膝盖", "舅妈", "茶", "药膏", "血压仪", "血糖仪", "起床", "鸟"],
                                             "休息":["下午", "下午", "低头", "发烧", "听", "回家", "地毯", "夏季", "外公", "外婆", "头痛", "奶奶", "客厅", "家", "平板电脑", "床", "感冒", "拖鞋", "枕头", "果汁", "桌子", "梨", "椅子", "椅子", "樱桃", "橙子", "毛毯", "水", "汽水", "沙发", "沙发", "浴缸", "淤青", "灯", "牛奶", "玩手机", "玩手机", "电脑", "电视机", "电视机", "瘙痒", "睡觉", "窗户", "笔记本电脑", "胃痛", "背心", "茶几", "躺下", "酸奶", "镜子", "门", "阳台"],
                                             "吃":["下午", "下巴", "包子", "南瓜", "叉子", "吃", "吃饭", "吃饭", "吐", "吞", "吸", "吸", "吹", "咬", "喝", "嘴巴", "嚼", "季节", "尝", "巧克力", "手套", "柠檬", "梨", "樱桃", "橙子", "洋葱", "火龙果", "牙齿", "牙齿", "牛油果", "狗", "猫", "玉米", "生姜", "番茄", "白菜", "白萝卜", "米饭", "米饭", "糖果", "糖果", "羊肉", "胡萝卜", "芒果", "苹果", "药店", "虫", "蚂蚁", "蛋糕", "蛋糕", "蛋黄", "蛋黄", "螃蟹", "街", "通心粉", "通心粉", "面包", "面包", "面条", "饼", "饼", "饼干", "饼干", "馒头", "馒头", "香肠", "香肠", "香菜", "香蕉", "鱼", "鱼肉", "鱼肉", "鸡肉", "鸡肉", "鸡蛋", "鸭肉", "鸭肉", "黄瓜"],
                                             "回家":["下午", "中午", "侄女", "侄子", "出租车", "外公", "外婆", "外甥", "外甥女", "奶奶", "妻子", "家", "家人", "玩手机", "脚", "舅妈", "视频", "邻居"],
                                             "公司":["下午", "头痛", "感冒", "打电话", "水", "淤青", "玩手机", "电梯", "瘙痒", "皮鞋", "胃痛", "说话"],
                                             "学校":["下午", "兄弟", "同学", "女人", "女孩", "姐妹", "学习", "学生", "年轻人", "水", "洗衣机", "男孩", "眼镜", "老师", "肩", "背包", "袖子", "说话"],
                                             "工作单位":["下午", "水", "眼镜", "背包", "领带"],
                                             "手表":["下午", "分钟", "小时"],
                                             "服务员":["下午", "包子", "南瓜", "厨房", "可乐", "土豆", "巧克力", "微波炉", "果汁", "柠檬", "梨", "樱桃", "橙子", "汽水", "牛奶", "牛肉", "猪肉", "玉米", "碗", "茶", "虾", "螃蟹", "酒", "酸奶", "面条", "鸡蛋"],
                                             "老板":["下午", "皮鞋", "茶", "视频"],
                                             "咖啡":["下午", "书店", "吹", "喝", "女人", "姐妹", "水", "牛奶"],
                                             "点心":["下午", "咬", "尝", "手机"],
                                             "茶":["下午", "书店", "吹", "喝", "水", "茶壶"],
                                             "暖":["下巴", "公园", "卫衣", "卫衣", "嘴巴", "围巾", "围巾", "家人", "帽子", "床", "床单", "康复训练", "开塞露", "按摩", "春季", "春季", "杯子", "毛巾", "毛毯", "毛毯", "水", "浴室", "牛奶", "生姜", "白菜", "笔", "笔记本", "筷子", "纸巾", "肩", "胡萝卜", "菠萝", "蛋糕", "蛋黄", "被子", "长裤", "长裤", "阳台", "青椒", "面包", "靴子", "饼"],
                                             "肉色":["下巴", "嘴巴", "大腿", "头", "小腿", "屁股", "手", "手指", "手肘", "手腕", "耳朵", "肩", "背", "胳膊", "脖子", "脚", "脸", "腰", "腹部", "腿", "膝盖", "鼻子"],
                                             "午餐":["中午", "中午", "羊肉", "蛋黄", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "太阳":["中午", "公园", "墨镜", "年轻人", "眼镜", "阳台", "雾"],
                                             "床":["中午", "保姆", "儿子", "午睡", "地毯", "女人", "女儿", "女孩", "妻子", "摇", "枕头", "毛毯", "爷爷", "睡觉", "睡觉", "被子", "起床", "起床", "躺下", "躺下"],
                                             "桌子":["中午", "书架", "保姆", "午睡", "学习", "按", "擦", "杯子", "树干", "桌子", "男孩", "看书", "笔", "笔记本", "筷子", "纸", "纸巾", "花瓶", "茶几", "茶壶", "餐巾"],
                                             "椅子":["中午", "保姆", "儿子", "吃饭", "女儿", "女孩", "树干", "桌子", "看书", "站", "老人", "背", "脖子", "腿", "轮椅", "马桶"],
                                             "电视":["中午", "医院", "听", "客厅", "家", "看电视", "眼睛", "眼镜", "眼镜"],
                                             "热":["中午", "包子", "厨房", "发烧", "吹风机", "夏季", "太阳", "太阳", "客厅", "家", "平板电脑", "手机", "星星", "晴天", "晴天", "晴天", "月亮", "果汁", "梨", "毛巾", "毛毯", "水", "沐浴露", "洋葱", "浴室", "煮锅", "煮锅", "牛奶", "牛油果", "电脑", "电视机", "番茄", "白菜", "白萝卜", "碗", "空调", "笔记本电脑", "羊肉", "背", "背心", "胡萝卜", "胳膊", "胸", "脖子", "脸", "腹部", "腿", "膝盖", "茶", "菜市场", "雷电", "风扇", "馒头", "香肠", "鱼", "鱼肉", "鸡肉", "鸭肉"],
                                             "勺子":["中午", "南瓜", "土豆", "巧克力", "杯子", "牛肉", "猪肉", "玉米", "碗", "米饭", "羊肉", "螃蟹", "酸奶", "面条", "香肠", "香菜", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "枕头":["中午", "午睡", "床", "床单", "睡觉", "睡觉"],
                                             "碗":["中午", "中药", "勺子", "包子", "南瓜", "叉子", "土豆", "洋葱", "煮锅", "牛肉", "猪肉", "玉米", "生姜", "番茄", "筷子", "米饭", "螃蟹", "闻", "面条", "鸡蛋"],
                                             "筷子":["中午", "包子", "南瓜", "土豆", "煮锅", "牛肉", "猪肉", "玉米", "碗", "米饭", "羊肉", "蛋黄", "螃蟹", "面条", "馒头", "香肠", "香菜", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "被子":["中午", "午睡", "床", "床单", "枕头", "洗衣机", "睡觉", "阳台"],
                                             "厨师":["中午", "冰箱", "刀子", "勺子", "包子", "南瓜", "厨房", "土豆", "外卖员", "尝", "平底锅", "扇贝", "手套", "果汁", "柠檬", "梨", "樱桃", "橙子", "汽水", "洋葱", "煮锅", "牛奶", "牛油果", "牛肉", "猪肉", "玉米", "白萝卜", "碗", "羊肉", "胡萝卜", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "蛋黄", "螃蟹", "袖子", "西兰花", "西瓜", "豆角", "酒", "酸奶", "青椒", "青菜", "面条", "香肠", "香菜", "香蕉", "鱼", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "中餐":["中午", "刀子", "羊肉", "蛋黄", "闻", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "汤":["中午", "勺子", "水", "煮锅", "牛肉", "猪肉", "碗", "菠菜", "酒", "面条"],
                                             "饭":["中午", "厨房", "发现", "吃饭", "吞", "妻子", "家", "牛肉", "猪肉", "碗", "腹部", "闻"],
                                             "生病":["中药", "中药", "中药", "内衣", "医生", "去医院", "去医院", "发烧", "发烧", "吃药", "吃药", "吐", "吸", "咳嗽", "咳嗽", "咳嗽", "喷嚏", "喷嚏", "外公", "外婆", "头晕", "奶奶", "护士", "柠檬", "梨", "梨", "橙子", "爷爷", "爷爷", "理疗师", "老人", "老鼠", "胃痛", "背", "胳膊", "胳膊", "胶囊", "胶囊", "胶囊", "脖子", "脖子", "脖子", "脚", "腿", "苍蝇", "药", "药", "药片", "药片", "药片", "药膏", "虫", "蚊子", "西兰花", "转身"],
                                             "同事":["中药", "停车场", "出租车", "头痛", "姐妹", "平板电脑", "感冒", "楼梯", "淤青", "电梯", "电脑", "瘙痒", "皮鞋", "碗", "胃痛", "胶囊", "药", "药片", "视频"],
                                             "朋友":["中药", "充电器", "公园", "出租车", "头痛", "姐妹", "感冒", "手机", "果汁", "柠檬", "梨", "樱桃", "橙子", "毛巾", "毛毯", "水", "汽水", "淤青", "牛奶", "狗", "瘙痒", "碗", "胃痛", "胶囊", "胸罩", "茄子", "药", "药片", "菠菜", "菠萝", "葡萄", "蘑菇", "西兰花", "西瓜", "豆角", "邻居", "酒", "酸奶", "青椒", "青菜"],
                                             "病人":["中药", "医生", "医院", "去医院", "发烧", "头痛", "感冒", "护士", "护工", "护理中心", "淤青", "理疗师", "瘙痒", "胃痛", "胳膊", "胶囊", "脖子", "脚", "脸", "腹部", "腿", "膝盖", "药", "药片", "药膏", "高肌张力"],
                                             "治疗":["中药", "医生", "医院", "去医院", "护工", "护理中心", "胶囊", "药", "药店", "药片"],
                                             "吃药":["中药", "中药", "发烧", "吞", "头痛", "感冒", "胶囊", "胶囊", "药", "药", "药片", "药片", "高肌张力"],
                                             "喝水":["中药", "杯子", "胶囊", "药", "药片", "走"],
                                             "看病":["中药", "医生", "医院", "医院", "医院", "去医院", "发烧", "口罩", "咳嗽", "头痛", "姐妹", "小孩", "感冒", "护理中心", "朋友", "淤青", "瘙痒", "胃痛", "胶囊", "腹部", "膝盖", "药", "药片", "高肌张力"],
                                             "发烧":["中药", "胶囊", "药店", "药片"],
                                             "甜":["中药", "包子", "南瓜", "可乐", "巧克力", "果汁", "梨", "樱桃", "橙子", "汽水", "洋葱", "火龙果", "牛奶", "玉米", "白菜", "白萝卜", "米饭", "糖果", "胡萝卜", "芒果", "苹果", "茶", "药", "菠萝", "葡萄", "蛋糕", "酒", "酸奶", "青菜", "面包", "饼干", "馒头", "香肠", "香蕉", "鱼肉", "鸡肉", "鸡蛋", "黄瓜"],
                                             "苦":["中药", "医生", "叔叔", "司机", "咖啡", "外卖员", "巧克力", "护工", "舅舅", "茶", "药", "药片", "鱼肉"],
                                             "酸":["中药", "果汁", "柠檬", "樱桃", "橙子", "芒果", "药", "葡萄", "酸奶", "面条", "黄瓜"],
                                             "医院":["中药", "医生", "去医院", "发烧", "口罩", "听", "头痛", "康复训练", "开塞露", "感冒", "扶", "护士", "护工", "护理中心", "按摩", "洗手池", "淤青", "牙齿", "理疗师", "瘙痒", "矫正板", "胃痛", "胶囊", "脖子", "腰", "腹部", "膝盖", "药", "药店", "药片", "药膏", "血压仪", "血糖仪", "轮椅", "高肌张力"],
                                             "药店":["中药", "胶囊", "药", "药片", "药膏"],
                                             "粉末":["中药", "瘙痒", "胶囊", "药", "通心粉", "面包"],
                                             "衣服":["中药", "儿子", "医院", "卫衣", "去医院", "口袋", "吹风机", "夏季", "头痛", "女人", "女儿", "女孩", "妻子", "家", "床单", "感冒", "枕头", "桌子", "椅子", "毛巾", "毛毯", "沐浴露", "沙发", "洗发露", "洗衣机", "洗面奶", "淤青", "灯", "煮锅", "牙刷", "牙膏", "男孩", "瘙痒", "睡觉", "碗", "窗户", "胃痛", "胶囊", "胸", "脖子", "茶几", "药", "药片", "起床", "躺下", "镜子", "门", "阳台", "马桶", "高肌张力"],
                                             "粘稠":["中药", "沐浴露", "洗发露", "酸奶"],
                                             "烫":["中药", "平底锅", "平板电脑", "微波炉", "手机", "灯", "电脑", "电视机", "笔记本电脑", "羊肉", "鱼"],
                                             "液体":["中药", "可乐", "咖啡", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "牛奶", "药", "酒", "酸奶", "鸡蛋"],
                                             "杯子":["中药", "勺子", "可乐", "吃药", "咖啡", "喝", "喝水", "外公", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "牛奶", "老人", "胶囊", "茶", "茶几", "药", "药片", "酸奶"],
                                             "瓶子":["中药", "可乐", "果汁", "汽水", "牛奶", "胶囊", "药", "药片"],
                                             "医生":["中药", "医院", "去医院", "发烧", "口罩", "吃药", "听", "咳嗽", "喷嚏", "头晕", "头痛", "康复训练", "开塞露", "感冒", "手套", "护士", "护工", "护理中心", "按摩", "救护车", "淤青", "牙刷", "牙膏", "牙齿", "狗", "猫", "理疗师", "瘙痒", "矫正板", "老人", "胃痛", "背", "胳膊", "胶囊", "胸", "脖子", "脚", "腰", "腹部", "腿", "膝盖", "药", "药店", "药片", "药膏", "血压仪", "血糖仪", "轮椅", "高肌张力"],
                                             "护士":["中药", "医生", "医院", "去医院", "发烧", "口罩", "吃药", "头痛", "康复训练", "开塞露", "感冒", "手套", "扶", "护工", "按摩", "淤青", "牙齿", "狗", "猫", "瘙痒", "矫正板", "胃痛", "胶囊", "腹部", "膝盖", "药", "药片", "药膏", "血压仪", "血糖仪", "轮椅"],
                                             "护工":["中药", "保姆", "医生", "发烧", "吃药", "头痛", "感冒", "扶", "护理中心", "淤青", "理疗师", "瘙痒", "老人", "胃痛", "背", "胳膊", "胶囊", "胸", "脖子", "脚", "脸", "腹部", "腿", "药", "药片", "药膏"],
                                             "嘴":["中药", "公园", "勺子", "叉子", "口红", "口罩", "吃", "吃药", "吃饭", "吐", "吞", "吹", "喝", "喝水", "手机", "打电话", "杯子", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "洋葱", "火龙果", "煮锅", "牙刷", "牙膏", "牙齿", "牙齿", "牛奶", "牛油果", "生姜", "番茄", "白菜", "白萝卜", "碗", "笔记本电脑", "筷子", "米饭", "米饭", "糖果", "纸巾", "羊肉", "胡萝卜", "胶囊", "芒果", "苹果", "茶", "茶壶", "药", "药店", "药片", "菜市场", "蛋糕", "蛋糕", "蛋黄", "说话", "通心粉", "通心粉", "酒", "酸奶", "面包", "面包", "饼", "饼", "饼干", "馒头", "香肠", "香菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜", "鼻子"],
                                             "皮肤":["中药", "毛巾", "沐浴露", "洗面奶", "淤青", "药"],
                                             "棕色":["中药", "凉鞋", "勺子", "叶子", "咖啡", "围巾", "树", "树干", "树枝", "楼梯", "汽水", "牛油果", "皮鞋", "羊肉", "背", "胳膊", "胸", "脖子", "脚", "脸", "腹部", "腿", "膝盖", "茶几", "茶壶", "药片", "蘑菇", "蟑螂", "香肠", "鱼", "鸭肉", "鼻子"],
                                             "深色":["中药", "咖啡", "靴子"],
                                             "黑色":["中药", "充电器", "冰箱", "凉鞋", "剃须刀", "卫衣", "叉子", "发卡", "发箍", "口袋", "可乐", "咖啡", "围巾", "墨镜", "头发", "头绳", "巧克力", "帽子", "平底锅", "平板电脑", "微波炉", "手写板", "晚上", "樱桃", "汽水", "洗手池", "洗衣机", "煮锅", "牙齿", "狗", "猫", "电视机", "皮鞋", "眼睛", "笔", "笔记本电脑", "老鼠", "耳机", "苍蝇", "茶", "虫", "虾", "蚂蚁", "蚊子", "车", "长裤", "阴天", "风扇", "香蕉", "鱼"],
                                             "纯净水":["中药", "胶囊", "药", "药片"],
                                             "学习":["书店", "书店", "书架", "低头", "侄女", "侄女", "侄子", "侄子", "儿子", "儿子", "儿子", "兄弟", "同学", "同学", "外甥", "外甥", "外甥女", "外甥女", "头绳", "女人", "女儿", "女儿", "女儿", "女孩", "女孩", "女孩", "姐妹", "姐妹", "学校", "学校", "学生", "学生", "小孩", "平板电脑", "手写板", "桌子", "椅子", "水", "沙发", "灯", "电脑", "男孩", "男孩", "男孩", "看书", "眼镜", "笔记本电脑", "老师", "老师", "背包", "茶几", "视频", "起床"],
                                             "同学":["书店", "充电器", "出租车", "剃须刀", "可乐", "姐妹", "平板电脑", "打电话", "楼梯", "洗衣机", "电脑", "眼镜", "空调", "背包", "胸罩", "说话"],
                                             "大":["书店", "书架", "云", "公共汽车", "公园", "冰箱", "凉鞋", "出租车", "包子", "医院", "南瓜", "卫衣", "厨房", "发卡", "发箍", "口罩", "口袋", "台风", "叶子", "商店", "地板", "墙壁", "太阳", "学校", "家", "帽子", "平底锅", "广场", "床", "床单", "康复训练", "护理中心", "按摩", "救护车", "星星", "晴天", "月", "月亮", "杯子", "枕头", "柜子", "树", "树林", "树枝", "桌子", "毛毯", "沐浴露", "沙发", "洗发露", "洗手池", "洗脚盆", "浴缸", "淤青", "火车", "煮锅", "狗", "皮鞋", "矫正板", "碗", "空调", "窗边", "羊肉", "肩", "背包", "背心", "胸", "脚", "脸盆", "茶几", "药膏", "菜市场", "蛋糕", "螃蟹", "血压仪", "街", "被子", "西瓜", "路", "车", "轮椅", "运动鞋", "郊外", "镜子", "长裤", "门", "雨", "雨天", "雪", "雷电", "雾", "面条", "靴子", "风", "风", "飞机", "饼", "香肠", "鱼", "鱼肉"],
                                             "宽敞":["书店", "厨房", "路"],
                                             "拥挤":["书店", "医院", "厨房", "脚"],
                                             "购买":["书店", "出门", "剃须刀", "口红", "口红", "售货员", "商店", "快递员", "服务员", "果汁", "汽水", "玉米", "番茄", "背心", "菜市场", "螃蟹", "走", "鸡蛋"],
                                             "打字":["书店", "电脑", "笔记本电脑"],
                                             "读":["书店", "书架", "平板电脑", "手机", "母亲", "父亲", "电脑", "男人", "笔记本电脑"],
                                             "图书馆":["书店", "发现", "玩手机", "看书"],
                                             "下雨":["书店", "公园", "凉鞋", "凉鞋", "发烧", "毛巾", "毛巾", "浴缸", "淤青", "眼镜", "蚊子", "雷电", "风"],
                                             "晴天":["书店", "公园", "出门", "墨镜", "太阳", "太阳", "星星", "星星", "晴天", "月亮", "月亮", "阳台"],
                                             "方形":["书店", "充电器", "公共汽车", "冰箱", "刀子", "医院", "厨房", "发卡", "口罩", "商店", "围巾", "地板", "墨镜", "学校", "客厅", "家", "巧克力", "平板电脑", "广场", "床单", "微波炉", "手写板", "手机", "指甲", "救护车", "桌子", "椅子", "毛巾", "毛毯", "沙发", "洗手池", "洗衣机", "浴室", "浴缸", "火车", "牙齿", "电梯", "电脑", "电视机", "矫正板", "空调", "窗户", "窗边", "笔记本", "笔记本电脑", "纸", "纸巾", "茶几", "药店", "药片", "药膏", "菜市场", "血糖仪", "街", "被子", "路", "车", "银行", "镜子", "门", "阳台", "餐巾", "饼干", "馒头", "马桶"],
                                             "木头":["书店", "书架", "公园", "刀子", "勺子", "客厅", "平底锅", "床", "床", "抽屉", "抽屉", "柜子", "柜子", "树干", "树干", "桌子", "椅子", "楼梯", "沙发", "窗边", "笔记本", "纸", "纸", "纸巾", "茶几", "酒", "门", "门口"],
                                             "纸":["书店", "树干", "笔", "笔记本"],
                                             "安静":["书店", "睡觉", "银行"],
                                             "眼睛":["书店", "午睡", "发现", "墨镜", "平板电脑", "手写板", "手机", "洋葱", "玩手机", "电脑", "电视机", "看", "看书", "看电视", "眼镜", "睡觉", "窗户", "笔记本电脑", "药", "药膏", "视频"],
                                             "白色":["书店", "云", "充电器", "公共汽车", "冬季", "冰箱", "凉鞋", "勺子", "包子", "医院", "卫衣", "厨房", "叉子", "发卡", "发烧", "发箍", "口罩", "口袋", "巧克力", "平板电脑", "微波炉", "手写板", "救护车", "星星", "晴天", "月", "月亮", "枕头", "果汁", "沐浴露", "洋葱", "洗发露", "洗手池", "洗衣机", "洗面奶", "浴缸", "火车", "火龙果", "牙刷", "牙膏", "牙齿", "牛奶", "狗", "猫", "玉米", "电视机", "白菜", "白萝卜", "皮鞋", "眼睛", "碗", "空调", "笔记本电脑", "米饭", "纸", "纸巾", "耳机", "肥皂", "背", "胳膊", "胶囊", "脖子", "脚", "脸", "脸", "腹部", "腿", "膝盖", "茄子", "药店", "药片", "蘑菇", "虫", "虾", "螃蟹", "血压仪", "血糖仪", "被子", "西兰花", "酒", "酸奶", "银行", "长裤", "雨天", "雪", "雷电", "雾", "面包", "面条", "靴子", "风扇", "飞机", "餐巾", "饼", "馒头", "马桶", "鱼肉", "鸡肉", "鸡蛋", "鼻子"],
                                             "开水":["书店", "公园", "吹", "杯子", "洗脚盆", "胶囊", "茶", "药", "药片"],
                                             "装修":["书架", "地板", "地毯", "墙壁", "床", "抽屉", "柜子"],
                                             "整理":["书架", "保姆", "刷牙", "剃须刀", "喝水", "手套", "手套", "护工", "抽屉", "抽屉", "柜子", "柜子", "毛巾", "洗澡", "洗脸", "洗面奶", "浴室", "浴缸", "清洁工", "社工", "蟑螂", "镜子", "镜子"],
                                             "放":["书架", "刀子", "手写板", "桌子", "桌子", "洗脚盆", "脸盆", "花瓶", "茶几", "茶几"],
                                             "室内":["书架", "停车场", "地板", "地毯", "墙壁", "窗边"],
                                             "块状":["书架", "墙壁", "床", "抽屉", "柜子", "羊肉", "蛋糕", "香肠", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "文学":["书架", "桌子", "椅子", "沙发", "灯", "纸", "茶几"],
                                             "玻璃":["书架", "公共汽车", "手写板", "救护车", "杯子", "清洁工", "火车", "灯", "电视机", "碗", "窗户", "窗边", "自行车", "花瓶", "茶几", "车", "镜子", "阳台", "飞机"],
                                             "硬":["书架", "地板", "巧克力", "床", "抽屉", "指甲", "柜子", "柠檬", "树干", "梨", "橙子", "洋葱", "玉米", "生姜", "番茄", "白萝卜", "眼镜", "胡萝卜", "膝盖", "药片", "菠萝", "螃蟹", "风扇"],
                                             "工人":["书架", "公园", "剪", "叶子", "司机", "同学", "商店", "地板", "墙壁", "学生", "平板电脑", "广场", "手套", "手机", "树", "树干", "树林", "树枝", "水", "浴室", "电梯", "电视机", "窗边", "笔记本电脑", "花", "草", "街", "路", "风扇", "馒头"],
                                             "设计师":["书架", "手机", "电脑", "画", "笔记本电脑", "脖子"],
                                             "重":["书架", "云", "低头", "充电器", "充电器", "公共汽车", "冰箱", "南瓜", "可乐", "吹", "吹风机", "咬", "嚼", "土豆", "地板", "墙壁", "太阳", "平底锅", "床", "康复训练", "微波炉", "抓", "抬头", "抱", "按", "按摩", "推", "插", "摇头", "救护车", "敲", "星星", "晴天", "月", "月亮", "枕头", "柜子", "树", "树干", "树枝", "桌子", "梨", "椅子", "橙子", "沐浴露", "沙发", "洗发露", "洗衣机", "浴缸", "火车", "火龙果", "点头", "煮锅", "牛肉", "狗", "猪肉", "猫", "玉米", "电脑", "电视机", "白菜", "白萝卜", "矫正板", "空调", "羊肉", "肩", "背包", "腿", "芒果", "花瓶", "茶几", "茶壶", "菠萝", "蛋糕", "螃蟹", "血压仪", "被子", "西瓜", "跑", "踢", "车", "轮椅", "门", "雷电", "靴子", "飞机", "饼", "香肠", "马桶", "鱼", "鸡肉", "鸭肉"],
                                             "天气":["云", "云", "台风", "台风", "天空", "天空", "太阳", "太阳", "星星", "星星", "春季", "晴天", "晴天", "月", "月亮", "月亮", "秋季", "阴天", "雨", "雨", "雨天", "雨天", "雪", "雪", "雷电", "雷电"],
                                             "聊天":["云", "侄女", "侄子", "叔叔", "台风", "外公", "外婆", "外甥", "外甥女", "天空", "奶奶", "婶婶", "客厅", "手机", "窗边", "老人", "舅妈", "舅舅", "说话", "阿姨"],
                                             "固体":["云", "刀子", "勺子", "南瓜", "土豆", "月", "柠檬", "桌子", "梨", "椅子", "樱桃", "橙子", "沙发", "浴缸", "灯", "秒钟", "窗户", "胶囊", "茄子", "茶几", "药", "药片", "菠菜", "菠萝", "葡萄", "蘑菇", "西兰花", "西瓜", "豆角", "镜子", "门", "青椒", "青菜", "马桶"],
                                             "锻炼":["休息", "休息", "公园", "公园", "出门", "午睡", "卫衣", "卫衣", "喝水", "夏季", "姐妹", "帽子", "帽子", "扔", "护工", "拍", "摇", "朋友", "朋友", "母亲", "毛巾", "沐浴露", "洗发露", "洗澡", "父亲", "男人", "男孩", "睡觉", "秒钟", "穿鞋", "背", "背", "背", "背", "背心", "背心", "胳膊", "胳膊", "胳膊", "胳膊", "胸", "胸", "胸", "脖子", "脖子", "腹部", "腹部", "腹部", "腿", "膝盖", "走", "跑", "跑", "蹲下", "转身", "运动鞋", "运动鞋", "运动鞋", "锻炼", "长裤", "香蕉", "香蕉"],
                                             "坐":["休息", "学校", "屁股", "椅子", "椅子", "沙发", "沙发", "看电视", "起床", "轮椅", "阳台", "马桶"],
                                             "运动场":["休息", "毛巾", "男孩", "秒钟", "跑", "转身", "运动鞋", "锻炼"],
                                             "沙发":["休息", "地板", "女人", "妻子", "客厅", "桌子", "毛毯", "毛毯", "看书", "看电视", "胳膊"],
                                             "书本":["休息", "儿子", "同学", "女人", "女儿", "女孩", "学校", "学生", "小孩", "年轻人", "男孩", "眼睛", "笔", "笔记本", "老人"],
                                             "游戏":["休息", "儿子", "儿子", "兄弟", "口红", "女人", "女儿", "女儿", "女儿", "女孩", "女孩", "女孩", "女孩", "姐妹", "姐妹", "家", "平板电脑", "平板电脑", "年轻人", "年轻人", "手机", "手机", "打", "朋友", "朋友", "父亲", "玩手机", "电脑", "电脑", "男人", "蘑菇", "裙子"],
                                             "电影":["休息", "分钟", "女人", "姐妹", "年轻人", "拍", "朋友", "朋友", "果汁", "果汁", "母亲", "汽水", "汽水", "父亲", "男人", "胸", "雨", "雨天", "雪", "雷电"],
                                             "视频":["休息", "分钟", "平板电脑", "拍", "玩手机", "电视机"],
                                             "表达":["低头", "打电话", "摇头", "理疗师", "说话"],
                                             "上课":["低头", "儿子", "同学", "嘴巴", "女儿", "女孩", "学生", "平板电脑", "抬头", "男孩", "走"],
                                             "突然":["低头", "抬头", "蟑螂"],
                                             "头":["低头", "发卡", "发箍", "墨镜", "头发", "头晕", "头绳", "帽子", "抬头", "摇头", "枕头", "洗发露"],
                                             "脖子":["低头", "围巾", "头", "抬头", "摇头", "脖子", "蚊子", "领带"],
                                             "亲戚":["侄女", "侄女", "侄女", "侄子", "侄子", "侄子", "停车场", "南瓜", "叔叔", "叔叔", "司机", "土豆", "外公", "外公", "外婆", "外婆", "外甥", "外甥", "外甥", "外甥女", "外甥女", "外甥女", "奶奶", "奶奶", "姐妹", "姑父", "婶婶", "婶婶", "年轻人", "手机", "树", "树林", "爷爷", "狗", "猫", "玉米", "舅妈", "舅妈", "舅舅", "舅舅", "花", "茶", "虾", "螃蟹", "阿姨", "阿姨", "鸡蛋"],
                                             "考试":["侄女", "侄子", "儿子", "儿子", "同学", "同学", "外甥", "外甥女", "女儿", "女儿", "女孩", "学习", "学生", "学生", "小孩", "男孩"],
                                             "聚会":["侄女", "侄女", "侄子", "侄子", "厨房", "叔叔", "叔叔", "外甥", "外甥", "外甥女", "外甥女", "婶婶", "婶婶", "舅妈", "舅妈", "舅舅", "舅舅", "蛋糕", "酒", "阿姨", "阿姨"],
                                             "叔叔":["侄女", "侄子", "凉鞋", "卫衣", "发卡", "发箍", "口罩", "口袋", "围巾", "外公", "外婆", "外甥", "外甥女", "头绳", "奶奶", "姑姑", "帽子", "母亲", "父亲", "爷爷", "长裤"],
                                             "姐妹":["侄女", "侄子", "儿子", "凉鞋", "卫衣", "发卡", "发箍", "墨镜", "外甥", "外甥女", "头绳", "女儿", "女孩", "家人", "帽子", "舅妈", "舅舅", "阿姨"],
                                             "阿姨":["侄女", "侄子", "凉鞋", "卫衣", "发卡", "发箍", "口罩", "口袋", "围巾", "头绳", "奶奶", "姑父", "帽子", "母亲", "父亲", "爷爷", "长裤"],
                                             "乖巧":["侄女", "侄子", "儿子", "外甥", "外甥女", "女儿", "女孩", "姐妹", "小孩", "男孩"],
                                             "好奇":["侄女", "侄子", "外甥", "外甥女", "男孩"],
                                             "调皮":["侄女", "侄子", "儿子", "外甥", "外甥女", "女儿", "女孩", "小孩", "男孩"],
                                             "少年":["侄女", "侄子", "儿子", "兄弟", "外甥", "外甥女", "女儿", "女孩", "姐妹", "姐妹", "姑姑", "学生", "家人", "朋友", "男人", "男孩", "男孩"],
                                             "幼年":["侄女", "侄子", "儿子", "兄弟", "外甥", "外甥女", "女儿", "女孩", "姐妹", "家人", "小孩", "朋友", "男人", "男孩", "男孩"],
                                             "成年":["侄女", "侄子", "叔叔", "外甥", "外甥女", "婶婶", "舅舅", "阿姨"],
                                             "童年":["侄女", "侄子", "儿子", "兄弟", "勺子", "外甥", "外甥女", "女儿", "女孩", "姐妹", "家人", "小孩", "朋友", "男人", "男孩", "男孩"],
                                             "青年":["侄女", "侄子", "儿子", "儿子", "兄弟", "口红", "售货员", "外甥", "外甥女", "女人", "女儿", "女儿", "女孩", "妻子", "姐妹", "姐妹", "姑姑", "姑父", "学生", "学生", "家人", "小孩", "年轻人", "快递员", "护士", "朋友", "服务员", "母亲", "清洁工", "父亲", "理疗师", "男人", "社工", "维修工", "老师", "舅妈", "青椒"],
                                             "女":["侄女", "保姆", "口红", "外婆", "外甥女", "女人", "女儿", "女孩", "奶奶", "妻子", "姐妹", "姑姑", "婶婶", "护士", "母亲", "生姜", "胸罩", "舅妈", "阿姨"],
                                             "假期":["侄女", "侄子", "外甥", "外甥女", "小孩", "舅妈"],
                                             "打招呼":["侄女", "侄子", "叔叔", "外甥", "外甥女", "婶婶", "舅妈", "舅舅", "邻居", "阿姨"],
                                             "玩耍":["侄女", "侄子", "儿子", "兄弟", "外甥", "外甥女", "太阳", "女人", "女儿", "女孩", "女孩", "姐妹", "小孩", "平板电脑", "晴天", "果汁", "汽水", "狗", "玩手机", "电脑", "电视机", "男孩", "笔记本电脑", "酒", "酒"],
                                             "住院":["保姆", "医生", "发烧", "护士", "护士", "护工", "护理中心", "爷爷", "理疗师", "理疗师", "老人"],
                                             "勤劳":["保姆", "医生", "叔叔", "婶婶", "快递员", "清洁工", "舅舅", "阿姨"],
                                             "围裙":["保姆", "刀子", "勺子", "厨房", "吃", "吃饭", "售货员", "平底锅", "菜市场"],
                                             "买菜":["保姆", "外公", "外婆", "奶奶", "白菜", "白萝卜", "胡萝卜", "邻居", "鱼"],
                                             "做饭":["保姆", "冰箱", "厨房", "柠檬", "梨", "樱桃", "橙子", "煮锅", "煮锅", "牛奶", "牛油果", "酸奶"],
                                             "接送":["保姆", "司机", "小孩"],
                                             "洗碗":["保姆", "厨房", "手套"],
                                             "洗衣服":["保姆", "内衣", "凉鞋", "卫衣", "围巾", "床单", "床单", "洗手池", "洗衣机", "睡衣", "背心", "长裤", "阳台", "阳台", "阳台"],
                                             "陪伴":["保姆", "护工", "护理中心", "狗", "猫", "理疗师", "社工"],
                                             "食物":["保姆", "冰箱", "厨房", "微波炉", "手套", "牙刷", "牙膏", "牙齿", "茄子", "茄子", "菠菜", "菠菜", "蘑菇", "蘑菇", "蚂蚁", "蛋黄", "被子", "西兰花", "西兰花", "豆角", "豆角", "闻", "青椒", "青椒", "青菜", "青菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "车祸":["停车场", "司机", "外卖员", "路", "轮椅", "雾"],
                                             "出门":["停车场", "口红", "口罩", "围巾", "墨镜", "家", "帽子", "水", "洗澡", "洗脸", "电梯", "眼镜", "穿衣服", "穿鞋", "穿鞋", "袜子", "袜子", "走", "邻居", "门口", "靴子", "靴子", "领带"],
                                             "开车":["停车场", "出租车", "出门", "去医院", "司机", "回家", "路"],
                                             "路边":["停车场", "出租车", "树枝", "银行", "鸟"],
                                             "司机":["停车场", "出租车", "分钟", "快递员", "锻炼", "雾"],
                                             "生育":["儿子", "儿子", "女人", "女儿", "女儿", "妻子"],
                                             "兄弟":["儿子", "凉鞋", "卫衣", "叔叔", "墨镜", "女儿", "女孩", "姐妹", "婶婶", "家人", "帽子"],
                                             "儿科":["儿子", "女儿", "女孩", "男孩"],
                                             "病房":["儿子", "女儿", "女孩"],
                                             "光":["儿子", "墨镜", "太阳", "太阳", "女儿", "女孩", "学生", "家", "小孩", "年轻人", "床单", "快递员", "星星", "星星", "晴天", "月亮", "月亮", "洗手池", "浴缸", "灯", "灯", "男人", "社工", "窗边", "花", "茶几", "镜子", "阳台", "阳台", "雷电", "雷电", "马桶"],
                                             "可爱":["儿子", "女儿", "女孩", "姐妹", "小孩", "朋友", "鸟"],
                                             "听话":["儿子", "女儿", "女孩", "小孩"],
                                             "天真":["儿子", "女人", "女儿", "女孩", "姐妹", "小孩"],
                                             "活泼":["儿子", "同学", "女人", "女儿", "女孩", "姐妹", "小孩", "年轻人", "朋友", "母亲", "男孩", "菠萝", "运动鞋"],
                                             "聪明":["儿子", "女儿", "女孩", "小孩", "维修工", "老师"],
                                             "中年":["儿子", "兄弟", "售货员", "女人", "女儿", "妻子", "姐妹", "姑姑", "姑父", "家人", "快递员", "护士", "朋友", "服务员", "母亲", "清洁工", "父亲", "爷爷", "理疗师", "男人", "社工", "维修工", "老师", "舅妈"],
                                             "乐器":["儿子", "女儿", "女孩"],
                                             "围棋":["儿子", "女儿", "女孩"],
                                             "漫画":["儿子", "女儿", "女孩", "姐妹", "小孩", "年轻人", "朋友", "画"],
                                             "玩具":["儿子", "女儿", "女孩", "男孩"],
                                             "童话":["儿子", "女儿", "蘑菇"],
                                             "舞蹈":["儿子", "女儿", "女孩", "胳膊", "脖子"],
                                             "象棋":["儿子", "外公", "女儿", "女孩", "老人"],
                                             "钢琴":["儿子", "女儿", "女孩"],
                                             "成长":["儿子", "儿子", "兄弟", "女人", "女儿", "女儿", "女孩", "女孩", "姐妹", "姐妹"],
                                             "鞋子":["儿子", "凉鞋", "后退", "外公", "外婆", "女人", "女儿", "女孩", "奶奶", "妻子", "客厅", "拖鞋", "男孩", "老人", "脚", "袜子", "跑", "进", "锻炼", "门口", "靴子", "鞋带"],
                                             "纸尿裤":["儿子", "女儿", "女孩", "小孩"],
                                             "奶粉":["儿子", "女儿", "女孩", "牛奶"],
                                             "营养":["儿子", "医院", "外公", "外婆", "头发", "女儿", "女孩", "奶奶", "妻子", "指甲", "果汁", "果汁", "柠檬", "柠檬", "梨", "梨", "樱桃", "樱桃", "橙子", "橙子", "汽水", "汽水", "牛奶", "牛奶", "牛油果", "瘙痒", "老人", "背", "胳膊", "胸", "脚", "腿", "花", "草", "菠菜", "蛋糕", "蟑螂", "西兰花", "酒", "酸奶", "酸奶", "青菜", "面包", "饼", "鱼", "鸟", "鸡肉"],
                                             "辅食":["儿子", "女儿", "女孩"],
                                             "侄女":["兄弟", "叔叔", "婶婶"],
                                             "侄子":["兄弟", "叔叔", "婶婶"],
                                             "嫂子":["兄弟", "叔叔", "婶婶"],
                                             "弟妹":["兄弟", "叔叔", "婶婶"],
                                             "酒":["兄弟", "喝", "头痛", "女人", "姐妹", "晚上", "杯子", "瘙痒", "胃痛", "膝盖", "药"],
                                             "户外":["充电器", "出租车", "出门", "吸", "围巾", "墨镜", "帽子", "扔", "晴天", "毛巾", "说话", "走", "阴天"],
                                             "插头":["充电器", "冰箱", "吹风机", "平板电脑", "微波炉", "手机", "插", "插", "洗衣机", "电脑", "电视机", "空调", "笔记本电脑", "血糖仪", "风扇"],
                                             "有电":["充电器", "冰箱", "冰箱", "平板电脑", "平板电脑", "微波炉", "微波炉", "手机", "手机", "洗衣机", "洗衣机", "电脑", "电脑", "电视机", "电视机", "空调", "空调", "笔记本电脑", "笔记本电脑", "血糖仪", "风扇", "风扇"],
                                             "电线":["充电器", "吹风机", "灯"],
                                             "盒子":["充电器", "公共汽车", "救护车", "血糖仪"],
                                             "交通":["公共汽车", "出门", "去医院", "去医院", "司机", "回家", "回家", "学校", "救护车", "自行车", "车"],
                                             "旅行":["公共汽车", "出租车", "同学", "姐妹", "年轻人", "星星", "春季", "朋友", "朋友", "树林", "水", "火车", "火车", "眼镜", "背包", "背包", "自行车", "自行车", "路", "车", "轮椅", "门口", "飞机", "飞机"],
                                             "坚硬":["公共汽车", "女人", "妻子", "姐妹", "扇贝", "手肘", "救护车", "桌子", "椅子", "母亲", "浴缸", "火车", "煮锅", "父亲", "眼镜", "碗", "窗户", "膝盖", "自行车", "茶几", "车", "轮椅", "镜子", "门", "飞机", "马桶"],
                                             "橡胶":["公共汽车", "凉鞋", "出租车", "手套", "拖鞋", "救护车", "电脑", "车", "轮椅", "飞机"],
                                             "金属":["公共汽车", "冰箱", "出租车", "刀子", "剃须刀", "勺子", "叉子", "发卡", "发箍", "吹风机", "商店", "学校", "家", "平底锅", "平板电脑", "广场", "微波炉", "手写板", "手机", "救护车", "杯子", "桌子", "椅子", "沙发", "洗衣机", "火车", "煮锅", "电梯", "电脑", "电视机", "眼镜", "秒钟", "空调", "笔记本电脑", "耳机", "自行车", "茶几", "药店", "菜市场", "血压仪", "车", "轮椅", "银行", "镜子", "门", "风扇", "飞机"],
                                             "健身":["公园", "牛油果", "男人", "胳膊", "腹部", "腿", "西兰花", "运动鞋", "鱼肉", "鸡肉"],
                                             "走":["公园", "凉鞋", "出门", "去医院", "后退", "后退", "回家", "外公", "外婆", "奶奶", "广场", "护工", "树林", "楼梯", "爷爷", "老人", "脚", "街", "街", "进", "进", "邻居", "郊外"],
                                             "救护车":["公园", "医生", "去医院", "家"],
                                             "轮椅":["公园", "医院", "医院", "外公", "外公", "外婆", "外婆", "奶奶", "奶奶", "客厅", "护工", "爷爷", "电梯", "电梯", "老人", "老人"],
                                             "放松":["公园", "公园", "凉鞋", "家", "广场", "玩手机", "玩手机", "看书", "看电视", "郊外"],
                                             "看":["公园", "分钟", "平板电脑", "手机", "洋葱", "灯", "牙齿", "玩手机", "电脑", "电视机", "看书", "眼睛", "眼睛", "窗户", "窗边", "笔记本电脑", "花", "镜子", "鱼", "鱼", "鸟"],
                                             "跑步":["公园", "脚", "膝盖", "运动鞋"],
                                             "跳舞":["公园", "发卡", "广场", "母亲", "胳膊", "胸", "脖子"],
                                             "花":["公园", "外公", "外婆", "女孩", "奶奶", "插", "插", "树枝", "社工", "花瓶", "鼻子"],
                                             "清新":["公园", "凉鞋", "刷牙", "果汁", "水", "汽水", "洗发露", "牙膏", "西瓜", "雨"],
                                             "卧室":["公园", "医院", "床单", "拖鞋", "枕头", "毛毯", "灯", "电梯", "睡觉", "窗户", "被子", "躺下", "门", "门口"],
                                             "空气":["公园", "树", "树林"],
                                             "圆形":["公园", "勺子", "南瓜", "发箍", "土豆", "墨镜", "巧克力", "帽子", "月", "桌子", "椅子", "洗脚盆", "灯", "白菜", "米饭", "脸盆", "膝盖", "自行车", "芒果", "花", "茄子", "茶几", "茶壶", "药片", "葡萄", "螃蟹", "蟑螂", "西瓜", "镜子", "青菜", "风扇", "饼", "饼干", "馒头", "鸡蛋"],
                                             "广场舞":["公园", "外婆", "奶奶", "广场", "老人"],
                                             "冷":["公园", "冰箱", "口罩", "外套", "大衣", "客厅", "家", "平板电脑", "手机", "晚上", "果汁", "柠檬", "梨", "樱桃", "橙子", "毛毯", "毛衣", "水", "汽水", "牛奶", "生姜", "电脑", "电视机", "矫正板", "秋衣", "空调", "笔记本电脑", "米饭", "糖果", "纸", "耳机", "背", "胳膊", "脖子", "脸", "腹部", "腿", "膝盖", "花瓶", "茶壶", "药店", "血压仪", "轮椅", "通心粉", "酒", "酸奶", "阳台", "雨", "雨天", "雪", "风扇", "餐巾", "饼干", "鱼肉", "鸡肉", "鸭肉"],
                                             "凉爽":["公园", "凉鞋", "客厅", "家", "秋季", "秋季", "空调", "窗边", "背心", "门口", "风扇"],
                                             "健康":["公园", "口罩", "吸", "喝水", "果汁", "运动鞋", "锻炼", "青菜"],
                                             "爷爷":["公园", "奶奶", "背心"],
                                             "绿色":["公园", "出租车", "卫衣", "叶子", "果汁", "柠檬", "树", "树林", "梨", "汽水", "洗脚盆", "淤青", "火车", "牛油果", "玉米", "白菜", "脸盆", "芒果", "苍蝇", "苹果", "茶", "草", "菜市场", "菠菜", "葡萄", "虫", "西兰花", "西瓜", "豆角", "郊外", "香菜", "香蕉", "黄瓜"],
                                             "保护":["内衣", "指甲", "袜子"],
                                             "脱下":["内衣", "凉鞋", "凉鞋", "卫衣", "卫衣", "口罩", "外套", "大衣", "帽子", "手套", "拖鞋", "拖鞋", "毛衣", "皮鞋", "睡衣", "短裤", "秋衣", "背心", "胸", "胸罩", "衬衣", "袖子", "袜子", "裙子", "运动鞋", "长裤", "长裤", "靴子", "鞋带", "领带"],
                                             "妇科":["内衣", "女人", "妻子"],
                                             "洗衣机":["内衣", "卫衣", "围巾", "外套", "大衣", "女人", "妻子", "家", "帽子", "床单", "毛巾", "毛毯", "毛衣", "睡衣", "短裤", "秋衣", "背心", "衬衣", "袖子", "裙子", "长裤", "阳台"],
                                             "棉":["内衣", "卫衣", "口罩", "口袋", "地毯", "外套", "帽子", "手套", "拖鞋", "枕头", "沙发", "睡衣", "短裤", "秋衣", "胸罩", "袖子", "袜子", "被子", "鞋带", "餐巾"],
                                             "滑":["内衣", "大衣", "睡衣", "秋衣", "衬衣", "面条"],
                                             "薄":["内衣", "毛巾", "毛毯", "睡衣", "背心", "袖子", "袜子"],
                                             "软":["内衣", "南瓜", "拖鞋", "柠檬", "梨", "樱桃", "橙子", "洗面奶", "牙膏", "牛油果", "猪肉", "玉米", "睡衣", "秋衣", "米饭", "胶囊", "胸", "胸罩", "花", "茄子", "草", "药膏", "葡萄", "西瓜", "面条", "香肠", "香蕉", "鱼", "鱼肉", "鼻子"],
                                             "胸部":["内衣", "抱", "胸罩"],
                                             "教室":["写", "学校", "平板电脑", "手写板", "电脑", "空调", "笔记本电脑", "风扇", "饼干"],
                                             "过节":["冬季", "商店", "外公", "外公", "外婆", "外婆", "奶奶", "奶奶", "姑姑", "姑父", "家人", "面条"],
                                             "空调":["冬季", "夏季", "家"],
                                             "祖母":["冰箱", "凉鞋", "包子", "南瓜", "卫衣", "厨房", "去医院", "发卡", "发箍", "口罩", "口袋", "叶子", "回家", "围巾", "土豆", "外公", "头绳", "女孩", "姑姑", "姑父", "家人", "帽子", "微波炉", "母亲", "洋葱", "洗衣机", "火龙果", "煮锅", "父亲", "爷爷", "牛肉", "猪肉", "玉米", "电视机", "番茄", "白菜", "白萝卜", "秋衣", "空调", "胡萝卜", "芒果", "苹果", "虾", "螃蟹", "说话", "长裤", "面条", "风扇", "鱼", "鸡蛋"],
                                             "祖父":["冰箱", "凉鞋", "剃须刀", "包子", "卫衣", "去医院", "发卡", "发箍", "口罩", "口袋", "叶子", "回家", "围巾", "墨镜", "外婆", "头绳", "女孩", "奶奶", "姑姑", "姑父", "家人", "帽子", "微波炉", "母亲", "洋葱", "洗衣机", "火龙果", "父亲", "牛肉", "猪肉", "电视机", "番茄", "白菜", "白萝卜", "秋衣", "空调", "背心", "胡萝卜", "芒果", "苹果", "说话", "运动鞋", "长裤", "面条", "风扇", "鱼"],
                                             "关闭":["冰箱", "冰箱", "剃须刀", "吹风机", "商店", "平板电脑", "平板电脑", "微波炉", "微波炉", "手写板", "手机", "手机", "抽屉", "柜子", "洗手池", "洗衣机", "洗衣机", "电脑", "电脑", "电视机", "电视机", "空调", "空调", "窗边", "窗边", "笔记本电脑", "笔记本电脑", "银行", "门", "门口", "风扇", "风扇", "马桶"],
                                             "打开":["冰箱", "剃须刀", "厨房", "口红", "可乐", "吹风机", "咖啡", "巧克力", "平板电脑", "床单", "微波炉", "手机", "抓", "抱", "推", "柜子", "毛巾", "洋葱", "洗手池", "洗衣机", "牙膏", "牛油果", "玉米", "电脑", "电视机", "空调", "窗边", "窗边", "笔记本电脑", "筷子", "药店", "葡萄", "豆角", "门", "风扇", "香蕉", "马桶"],
                                             "饿":["冰箱", "吃", "微波炉", "煮锅", "碗", "米饭", "胃痛"],
                                             "腥":["冰箱", "菜市场", "虾", "螃蟹", "鱼", "鱼肉", "鸡蛋"],
                                             "香":["冰箱", "厨房", "床单", "微波炉", "枕头", "洗发露", "洗面奶", "浴室", "牛肉", "猪肉", "纸巾", "羊肉", "肥皂", "脸", "花", "茶", "草", "螃蟹", "街", "被子", "西兰花", "面条", "香菜", "香蕉", "鸡肉", "鸡蛋"],
                                             "厨房":["冰箱", "刀子", "勺子", "平底锅", "微波炉", "手套", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "洋葱", "洗手池", "灯", "煮锅", "牛奶", "牛油果", "牛肉", "猪肉", "玉米", "生姜", "番茄", "白菜", "白萝卜", "碗", "窗户", "羊肉", "胡萝卜", "苍蝇", "茄子", "菠菜", "蘑菇", "蛋黄", "蟑螂", "袖子", "西兰花", "豆角", "酸奶", "门", "青椒", "青菜", "面条", "香肠", "香菜", "鱼", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "超市":["冰箱", "售货员", "微波炉", "羊肉", "羊肉", "蛋黄", "香肠", "香肠", "香菜", "香蕉", "香蕉", "香蕉", "鱼肉", "鱼肉", "鸡肉", "鸡肉", "鸭肉", "鸭肉", "黄瓜", "黄瓜"],
                                             "餐厅":["冰箱", "刀子", "勺子", "厨房", "可乐", "吃", "吃饭", "吞", "喝", "嘴巴", "嚼", "外卖员", "尝", "微波炉", "手套", "擦", "服务员", "杯子", "果汁", "柠檬", "梨", "樱桃", "橙子", "水", "汽水", "洋葱", "清洁工", "煮锅", "牛奶", "牛油果", "牛肉", "猪肉", "玉米", "电视机", "白萝卜", "碗", "空调", "米饭", "羊肉", "胡萝卜", "茶", "蛋黄", "蟑螂", "通心粉", "酒", "酸奶", "面包", "面条", "风扇", "餐巾", "饼", "馒头", "香肠", "香菜", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "光滑":["冰箱", "刀子", "厨房", "口红", "墙壁", "平底锅", "平板电脑", "床", "微波炉", "手套", "手机", "抽屉", "柠檬", "桌子", "椅子", "樱桃", "橙子", "洗手池", "洗脚盆", "洗衣机", "浴缸", "电脑", "电视机", "皮鞋", "碗", "空调", "窗户", "笔记本电脑", "脸盆", "茶几", "草", "蘑菇", "蟑螂", "血糖仪", "镜子", "门", "风扇", "马桶", "鱼", "鸡蛋"],
                                             "冰":["冰箱", "可乐", "火龙果", "芒果"],
                                             "故障":["冰箱", "平板电脑", "微波炉", "手机", "洗衣机", "电脑", "电视机", "空调", "笔记本电脑", "风扇"],
                                             "正常":["冰箱", "平板电脑", "微波炉", "手机", "洗衣机", "电脑", "电视机", "空调", "窗户", "笔记本电脑", "自行车", "风扇"],
                                             "胃":["冰箱", "微波炉", "煮锅", "碗", "胃痛"],
                                             "灰色":["冰箱", "刀子", "勺子", "叉子", "发箍", "平底锅", "平板电脑", "手写板", "楼梯", "洗衣机", "猫", "电梯", "电视机", "笔记本电脑", "蘑菇", "螃蟹", "街", "路", "阴天", "雨天", "风扇", "鱼"],
                                             "银色":["冰箱", "剃须刀", "平板电脑", "微波炉", "洗衣机", "煮锅", "电视机", "空调", "笔记本电脑", "轮椅", "镜子", "风扇"],
                                             "弟弟":["凉鞋", "卫衣", "女孩", "家人", "帽子"],
                                             "宽":["凉鞋", "卫衣", "床单", "楼梯", "洗手池", "窗边", "长裤", "面条", "面条"],
                                             "瘦":["凉鞋", "卫衣", "牛肉", "狗", "猪肉", "猫", "男孩", "老鼠", "腹部", "虾", "螃蟹", "螃蟹", "长裤"],
                                             "刷":["凉鞋", "凉鞋", "洗手池", "洗手池", "洗澡", "洗脸", "清洁工", "牙刷", "牙刷", "牙齿", "皮鞋", "背心"],
                                             "凉":["凉鞋", "刀子", "勺子", "可乐", "手写板", "枕头", "毛巾", "毛毯", "沐浴露", "洋葱", "洗发露", "洗面奶", "浴缸", "火龙果", "牙刷", "牙膏", "牛油果", "生姜", "番茄", "白萝卜", "碗", "窗户", "腹部", "芒果", "苹果", "茄子", "茶", "茶几", "菠菜", "蟑螂", "西兰花", "西瓜", "镜子", "青菜", "香肠", "香菜", "香蕉", "马桶", "鱼", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "轻松":["凉鞋", "刷牙", "叶子", "吸", "回家", "学习", "手机", "打电话", "星星", "洗澡", "洗脸", "猫", "玩手机", "看书", "看电视", "耳机", "腿", "苍蝇", "走", "运动鞋", "锻炼", "长裤"],
                                             "洗衣粉":["凉鞋", "卫衣", "围巾", "洗手池", "背心", "长裤"],
                                             "脚":["凉鞋", "出门", "去医院", "回家", "地板", "地毯", "拖鞋", "指甲", "洗澡", "洗脚盆", "皮鞋", "穿鞋", "蚊子", "蟑螂", "袜子", "走", "运动鞋", "锻炼", "靴子", "鞋带"],
                                             "洗":["出租车", "刀子", "剃须刀", "勺子", "卫衣", "发烧", "墨镜", "头发", "女人", "妻子", "帽子", "平底锅", "杯子", "毛巾", "毛巾", "沐浴露", "洗发露", "洗手池", "洗手池", "洗脚盆", "洗衣机", "洗面奶", "洗面奶", "洗面奶", "洗面奶", "浴缸", "浴缸", "煮锅", "牙齿", "玉米", "皮鞋", "碗", "窗边", "纸巾", "羊肉", "背心", "脸", "脸", "脸盆", "脸盆", "蛋黄", "镜子", "镜子", "长裤", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜", "鼻子"],
                                             "早晨":["出租车", "刷牙", "剃须刀", "包子", "去医院", "吃", "吃药", "吃饭", "吹", "咖啡", "喝", "嚼", "墨镜", "尝", "工作", "毛巾", "洗澡", "洗脸", "洗面奶", "浴缸", "灯", "煮锅", "牙刷", "牙膏", "牙齿", "睡觉", "碗", "穿衣服", "穿鞋", "米饭", "说话", "起床", "锻炼", "镜子", "面条", "馒头", "马桶", "鸟"],
                                             "晚上":["出租车", "刷牙", "去医院", "发烧", "吃", "吃药", "吃饭", "吹", "喝", "嚼", "回家", "尝", "打电话", "星星", "月", "月亮", "枕头", "毛巾", "毛毯", "沐浴露", "洗发露", "洗澡", "洗脚盆", "洗脸", "洗面奶", "浴缸", "灯", "煮锅", "牙刷", "牙膏", "牙齿", "玩手机", "电视机", "瘙痒", "看电视", "睡觉", "碗", "穿衣服", "米饭", "背心", "脸盆", "被子", "说话", "锻炼", "镜子", "面条", "馒头", "马桶"],
                                             "新":["出租车", "毛巾", "毛毯", "牙刷", "碗", "药膏"],
                                             "旧":["出租车", "毛巾", "毛毯", "牙刷", "碗"],
                                             "水":["出租车", "喝水", "果汁", "果汁", "毛巾", "水", "汽水", "汽水", "沐浴露", "洗脚盆", "浴缸", "牛奶", "牛奶", "碗", "纸巾", "螃蟹", "酒", "酒", "酸奶", "酸奶", "雨", "雨天", "雪", "鸟"],
                                             "红色":["出租车", "卫衣", "发卡", "口红", "叶子", "围巾", "太阳", "月", "果汁", "樱桃", "橙子", "牛肉", "猪肉", "番茄", "羊肉", "胡萝卜", "胶囊", "脸", "芒果", "苹果", "茶", "菜市场", "虾", "蚂蚁", "螃蟹", "西瓜", "酒", "香肠", "鸭肉"],
                                             "黄色":["出租车", "南瓜", "卫衣", "厨房", "发卡", "叶子", "土豆", "太阳", "星星", "月", "月亮", "果汁", "柠檬", "梨", "樱桃", "橙子", "汽水", "洗手池", "洗脚盆", "牙齿", "狗", "猫", "玉米", "生姜", "筷子", "胡萝卜", "胶囊", "脸盆", "芒果", "茶", "茶几", "药片", "菠萝", "虫", "蛋糕", "蛋黄", "通心粉", "酒", "面条", "饼干", "香蕉", "鸡蛋", "黄瓜"],
                                             "火车":["出门", "桌子", "椅子", "灯", "睡觉", "空调", "窗户", "笔记本电脑", "羊肉", "蛋黄", "镜子", "门", "香肠", "香蕉", "马桶", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "社交":["出门", "吃饭", "客厅", "广场", "点头", "玩手机", "走", "邻居", "酒"],
                                             "坐车":["出门", "去医院", "回家", "走"],
                                             "远":["出门", "听", "看"],
                                             "切":["刀子", "柠檬", "梨", "橙子", "牛肉", "猪肉", "玉米", "生姜", "番茄", "羊肉", "茄子", "蘑菇", "蛋黄", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "烹饪":["刀子", "厨房", "平底锅", "平底锅", "微波炉", "洋葱", "洋葱", "番茄", "番茄", "白菜", "白萝卜", "胡萝卜"],
                                             "医疗器械":["刀子", "去医院", "口罩", "矫正板", "药店", "血压仪", "轮椅"],
                                             "水果店":["刀子", "火龙果", "牛油果", "芒果", "苹果", "菠萝", "葡萄", "西瓜", "香蕉"],
                                             "塑料":["刀子", "剃须刀", "勺子", "叉子", "发卡", "发箍", "吹风机", "头绳", "手写板", "手套", "桌子", "椅子", "洗脚盆", "浴室", "牙刷", "电脑", "电视机", "矫正板", "碗", "空调", "窗户", "笔", "耳机", "脸盆", "茶几", "菜市场", "镜子", "门", "风扇"],
                                             "陶瓷":["刀子", "医院", "厨房", "叉子", "客厅", "杯子", "浴室", "浴缸", "窗边", "花瓶", "门口", "马桶"],
                                             "危险":["刀子", "救护车", "雷电"],
                                             "水果":["刀子", "叉子", "季节", "果汁", "果汁", "果汁", "树干", "玉米", "菜市场", "菠萝", "葡萄", "西瓜", "酒", "黄瓜"],
                                             "甜品":["刀子", "勺子", "勺子", "叉子", "夏季", "柠檬", "樱桃", "牛奶", "芒果", "芒果", "菠萝", "菠萝", "菠萝", "葡萄", "葡萄", "葡萄", "蛋糕", "蛋糕", "蛋黄", "西瓜", "西瓜", "西瓜", "酸奶", "面包", "饼干"],
                                             "西餐":["刀子", "羊肉", "花瓶", "蛋黄", "香肠", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "电影院":["分钟", "听", "果汁", "水", "汽水", "酒"],
                                             "约会":["刷牙", "发卡", "头绳", "抱", "星星", "月亮"],
                                             "起床":["刷牙", "床", "洗澡", "洗脸", "穿衣服"],
                                             "酒店":["刷牙", "可乐", "吃", "吃饭", "床", "床单", "抽屉", "服务员", "柜子", "洗澡", "洗脸", "清洁工", "睡觉", "茶"],
                                             "牙膏":["刷牙", "浴室", "牙刷", "牙膏", "牙齿", "药膏"],
                                             "干净":["刷牙", "平底锅", "枕头", "毛巾", "洗澡", "洗脸", "浴室", "浴缸", "牙膏", "牙齿", "碗", "窗户", "茶几", "镜子", "马桶"],
                                             "脸":["刷牙", "剃须刀", "口罩", "墨镜", "拍", "擦", "枕头", "毛巾", "洗手池", "洗脸", "洗面奶", "眼睛", "耳朵", "脸盆", "视频", "镜子"],
                                             "卫生间":["剃须刀", "头发", "洗手池", "浴缸", "灯", "牙齿", "窗户", "脸", "蟑螂", "镜子", "门", "马桶"],
                                             "长":["剃须刀", "卫衣", "围巾", "头绳", "床单", "树干", "树枝", "白萝卜", "脖子", "腿", "茄子", "药膏", "虾", "豆角", "长裤", "面条"],
                                             "理发师":["剃须刀", "吹风机", "头发"],
                                             "花园":["剪", "护理中心", "树干", "花", "草"],
                                             "头发":["剪", "发卡", "发箍", "吹风机", "头绳", "帽子", "洗发露", "洗手池", "风"],
                                             "满":["勺子", "口袋", "杯子", "洗脚盆", "脸盆", "茶壶"],
                                             "空":["勺子", "口袋", "杯子", "洗脚盆", "脸盆", "茶壶"],
                                             "盘子":["勺子", "包子", "叉子", "柠檬", "梨", "樱桃", "橙子", "洋葱", "牛油果", "牛肉", "猪肉", "番茄", "芒果", "蛋糕", "螃蟹", "通心粉", "闻", "面条", "馒头", "香肠", "鸡蛋"],
                                             "粥":["勺子", "医院", "煮锅", "碗", "社工"],
                                             "客人":["包子", "可乐", "吹风机", "售货员", "客厅", "巧克力", "服务员", "果汁", "柠檬", "桌子", "桌子", "梨", "椅子", "椅子", "樱桃", "橙子", "水", "汽水", "沙发", "沙发", "牛奶", "电视机", "窗户", "羊肉", "茶几", "茶几", "蛋黄", "酒", "酸奶", "门", "面条", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "补充":["包子", "巧克力", "橙子", "汽水", "西兰花", "酸奶", "青菜", "面条", "香蕉"],
                                             "饱腹":["包子", "巧克力", "面条"],
                                             "煎":["包子", "厨房", "牛肉", "猪肉", "鸡蛋"],
                                             "蒸":["包子", "南瓜", "厨房", "土豆", "扇贝", "茄子", "蘑菇", "虾", "蛋黄", "西兰花", "豆角", "馒头", "香肠", "鱼肉", "鸡肉", "鸭肉"],
                                             "咸":["包子", "汽水", "羊肉", "脚", "蛋黄", "螃蟹", "豆角", "面条", "香肠", "鱼肉", "鸡肉", "鸡蛋", "鸭肉"],
                                             "柔软":["包子", "口红", "嘴巴", "大腿", "头", "头发", "小腿", "屁股", "床单", "手", "手腕", "枕头", "毛巾", "毛毯", "沙发", "牙刷", "耳朵", "脸", "腹部", "运动鞋", "馒头"],
                                             "肉":["包子", "吃饭", "咬", "嚼", "大腿", "头", "小腿", "屁股", "手", "手腕", "背", "胳膊", "胸", "脚", "腹部", "腿", "菜市场", "面条", "香肠"],
                                             "能量":["包子", "巧克力", "面条"],
                                             "蔬菜":["包子", "外公", "外婆", "奶奶", "季节", "果汁", "菜市场", "面条", "黄瓜"],
                                             "面条":["包子", "叉子", "吃饭", "吹", "洋葱", "煮锅", "牛肉", "猪肉", "筷子", "通心粉"],
                                             "手术":["医生", "医生", "医院", "口罩", "口罩", "手套", "护工", "膝盖", "鼻子"],
                                             "打针":["医院", "发烧", "头痛", "感冒", "手套", "手套", "药"],
                                             "消毒液":["医院", "救护车", "药店"],
                                             "难受":["医院", "去医院", "吐", "头痛", "胳膊", "鼻子"],
                                             "躺":["午睡", "发烧", "头痛", "床", "感冒", "拖鞋", "枕头", "枕头", "浴缸", "淤青", "爷爷", "看电视", "睡觉"],
                                             "中午":["午睡", "去医院", "吃", "吃药", "吃饭", "吹", "喝", "嚼", "墨镜", "尝", "床", "打电话", "枕头", "煮锅", "睡觉", "碗", "米饭", "背心", "说话", "起床", "面条", "馒头"],
                                             "浅":["午睡", "学习", "睡觉"],
                                             "深":["午睡", "学习", "睡觉"],
                                             "丰收":["南瓜", "土豆", "玉米", "番茄", "白菜", "白萝卜", "秋季", "秋季", "胡萝卜", "苹果"],
                                             "煮":["南瓜", "厨房", "煮锅", "煮锅", "玉米", "米饭", "羊肉", "茄子", "茶", "菠菜", "蘑菇", "蛋黄", "西兰花", "豆角", "通心粉", "青椒", "青菜", "面条", "香肠", "香菜", "鱼", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "秋天":["南瓜", "卫衣", "发烧", "叶子", "夏季", "外套", "大衣", "季节", "帽子", "毛毯", "毛衣", "长裤", "鸟"],
                                             "刀":["南瓜", "土豆", "柠檬", "梨", "樱桃", "橙子", "洋葱", "牛肉", "猪肉", "玉米", "生姜", "番茄", "白菜", "白萝卜", "羊肉", "胡萝卜", "芒果", "蛋黄", "螃蟹", "香肠", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "叉子":["南瓜", "土豆", "洋葱", "牛肉", "猪肉", "羊肉", "蛋糕", "蛋黄", "螃蟹", "通心粉", "香肠", "鱼肉", "鸡肉", "鸡蛋", "鸭肉", "黄瓜"],
                                             "盆":["南瓜", "卫衣", "围巾", "土豆", "外公", "外婆", "奶奶", "毛巾", "洗发露", "洗手池", "洗面奶", "浴缸", "煮锅", "碗", "长裤", "马桶"],
                                             "锅":["南瓜", "土豆", "牛肉", "猪肉", "玉米", "番茄", "白菜", "碗", "胡萝卜", "螃蟹", "通心粉", "面条", "香肠", "鸡蛋"],
                                             "瓜子":["南瓜", "牙齿", "电视机"],
                                             "短":["卫衣", "围巾", "头绳", "树枝", "脖子", "腿", "长裤"],
                                             "烘干机":["卫衣", "围巾", "外套", "大衣", "帽子", "毛衣", "睡衣", "短裤", "秋衣", "衬衣", "袖子", "裙子", "长裤"],
                                             "冬天":["卫衣", "围巾", "夏季", "大衣", "季节", "帽子", "毛毯", "毛衣", "白菜", "白萝卜", "空调", "空调", "腿", "长裤", "雪", "靴子", "靴子", "风"],
                                             "春天":["卫衣", "叶子", "夏季", "外套", "大衣", "季节", "帽子", "春季", "毛衣", "花", "草", "长裤", "雨", "雨天", "雾", "风", "鸟"],
                                             "衣架":["卫衣", "围巾", "毛巾", "背心", "长裤"],
                                             "蓝色":["卫衣", "口罩", "天空", "救护车", "晴天", "洗脚盆", "淤青", "胶囊", "脸盆", "药店", "长裤"],
                                             "窄":["厨房", "楼梯", "洗手池", "窗边", "面条"],
                                             "搅拌":["厨房", "果汁", "水", "汽水", "牛奶", "药膏", "酒", "酸奶", "面条"],
                                             "炒":["厨房", "土豆", "牛肉", "猪肉", "羊肉", "茄子", "茶", "菠菜", "蘑菇", "蛋黄", "西兰花", "豆角", "青椒", "青菜", "面条", "香肠", "鱼", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "炖":["厨房", "土豆", "牛肉", "猪肉", "玉米"],
                                             "烤":["厨房", "土豆", "牛肉", "猪肉", "玉米", "茄子", "蘑菇", "蛋糕", "西兰花", "豆角", "青椒", "青菜", "面包", "饼", "饼干"],
                                             "烧":["厨房", "树枝", "玉米", "虾", "螃蟹", "鱼"],
                                             "房间":["厨房", "地毯", "墙壁", "蟑螂", "门"],
                                             "食堂":["厨房", "吃", "吃饭", "嚼", "学校", "尝", "洋葱", "牛肉", "猪肉", "玉米", "生姜", "番茄", "白菜", "白萝卜", "米饭", "胡萝卜", "苹果", "面条", "馒头", "香肠", "鸡蛋"],
                                             "餐具":["厨房", "吃饭", "手套", "树干", "桌子", "洋葱", "牛油果", "番茄", "茄子", "茶几", "菜市场", "菠菜", "菠萝", "葡萄", "蘑菇", "西兰花", "西瓜", "豆角", "青椒", "青菜"],
                                             "菜":["厨房", "发现", "吃饭", "妻子", "尝", "碗", "闻"],
                                             "药":["去医院", "吃药", "外公", "外婆", "奶奶", "开塞露", "开塞露", "抓", "护士", "撕", "爷爷", "药店", "蘑菇", "闻"],
                                             "康复":["去医院", "吃", "康复训练", "康复训练", "护工", "护理中心", "按摩", "按摩", "脖子", "脚", "腿"],
                                             "牛排":["叉子", "姐妹", "牛肉"],
                                             "装饰":["发卡", "发卡", "发箍", "发箍", "围巾", "地毯", "头绳", "头绳", "女人", "妻子", "帽子", "帽子", "床单", "胸罩", "领带"],
                                             "条状":["发卡", "灯", "笔", "筷子", "羊肉", "耳机", "胳膊", "脖子", "腿", "草", "虫", "豆角", "面条", "鞋带", "香肠", "鱼", "鸡肉", "鸭肉", "黄瓜"],
                                             "漂亮":["发卡", "发箍", "口红", "头绳", "女儿", "女孩", "小孩", "花"],
                                             "化妆":["发卡", "发箍", "口红", "口红", "吹风机", "头绳", "女人", "脸", "镜子", "镜子"],
                                             "镜子":["发卡", "发箍", "口红", "头发", "帽子", "脸盆"],
                                             "冰敷":["发烧", "头痛", "感冒", "淤青", "淤青"],
                                             "呕吐":["发烧", "头痛", "马桶"],
                                             "打点滴":["发烧", "外公", "外婆", "奶奶", "爷爷"],
                                             "测量":["发烧", "血压仪", "血糖仪", "血糖仪"],
                                             "睡觉":["发烧", "头痛", "家", "床", "感冒", "拖鞋", "拖鞋", "枕头", "枕头", "淤青", "火车", "灯", "灯", "牙刷", "睡衣", "睡觉", "被子", "被子", "躺下", "雨天"],
                                             "脆弱":["发烧", "外公", "外婆", "奶奶", "感冒", "牙齿", "男人", "男孩", "老人", "胳膊", "腹部", "膝盖", "走"],
                                             "香水":["发现", "脖子", "衬衣"],
                                             "科学家":["发现", "太阳", "星星", "晴天", "月亮", "蚂蚁", "雨", "雨天"],
                                             "洗澡":["发箍", "拖鞋", "毛巾", "沐浴露", "沐浴露", "洗发露", "浴室", "浴缸", "浴缸", "肥皂", "肥皂"],
                                             "善良":["叔叔", "女人", "妻子", "姐妹", "姑姑", "姑父", "婶婶", "护士", "护工", "朋友", "母亲", "父亲", "爷爷", "理疗师", "社工", "老人", "老师", "舅妈", "舅舅", "邻居", "阿姨"],
                                             "成熟":["叔叔", "洋葱", "火龙果", "牛油果", "玉米", "生姜", "番茄", "白菜", "白萝卜", "老人", "胡萝卜", "舅舅", "芒果", "苹果", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "西兰花", "西瓜", "豆角", "青椒", "青菜"],
                                             "拍照":["口红", "手机", "花", "茄子", "裙子"],
                                             "涂抹":["口红", "沐浴露", "洗发露", "洗澡", "洗面奶", "药膏"],
                                             "柱状":["口红", "杯子", "沐浴露", "洗发露", "洗面奶", "煮锅", "牙膏", "白萝卜", "秒钟", "胡萝卜", "胶囊", "蛋糕"],
                                             "模特":["口红", "吹风机", "脸", "腿"],
                                             "防护":["口罩", "手套", "袖子"],
                                             "病毒":["口罩", "毛巾", "毛毯", "药店", "蟑螂"],
                                             "病菌":["口罩", "地板", "地毯", "墙壁", "床", "抽屉", "指甲", "柜子", "毛巾", "毛毯", "浴缸", "牙刷", "牙膏", "瘙痒", "蘑菇", "蟑螂", "马桶"],
                                             "社区":["口罩", "社工", "维修工", "邻居"],
                                             "鼻子":["口罩", "肥皂", "茶壶", "闻"],
                                             "裤子":["口袋", "夏季", "大腿", "女人", "妻子", "洗衣机", "膝盖", "长裤", "阳台"],
                                             "解渴":["可乐", "吸", "果汁", "水", "汽水", "牛奶", "茶", "菠萝", "西瓜", "酒"],
                                             "倒出":["可乐", "咖啡", "客厅", "杯子", "果汁", "水", "汽水", "洗手池", "洗脚盆", "牛奶", "脸盆", "茶", "酒", "酸奶"],
                                             "吸":["可乐", "吃", "咖啡", "汽水", "牛奶", "酒", "酸奶", "面条"],
                                             "喝":["可乐", "吃", "吃药", "吐", "吸", "吹", "咖啡", "咬", "喝", "嚼", "尝", "果汁", "水", "汽水", "牛奶", "茶", "酒", "酸奶", "鸡蛋"],
                                             "吸管":["可乐", "咖啡", "汽水", "牛奶", "酒", "酸奶"],
                                             "台风":["台风", "听", "夏季", "雨", "雨天"],
                                             "暴雨":["台风", "夏季", "雨", "雨天", "雷电"],
                                             "树":["叶子", "季节", "摇", "柠檬", "树干", "社工", "风", "鸟"],
                                             "片状":["叶子", "胸罩", "药", "药片", "雪", "香肠", "鱼肉"],
                                             "热心":["司机", "外卖员", "舅妈"],
                                             "活":["吃", "吃饭", "睡觉"],
                                             "咬":["吃", "吃饭", "狗", "笔", "虫"],
                                             "中毒":["吃", "吸", "酒"],
                                             "胖":["吃", "狗", "猫", "男孩", "老鼠", "腹部", "虾", "螃蟹", "螃蟹"],
                                             "舌头":["吃", "吃饭", "尝", "牙刷", "牙膏", "牙齿"],
                                             "举":["吃药", "喝水", "平底锅", "果汁", "水", "汽水", "牛奶", "玩手机", "酒", "酸奶", "阳台"],
                                             "夹":["吃饭", "螃蟹", "面条"],
                                             "餐桌":["吃饭", "碗", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "西兰花", "西瓜", "豆角", "青椒", "青菜"],
                                             "热情":["同学", "售货员", "快递员", "服务员", "社工", "菠萝", "邻居"],
                                             "作业":["同学", "同学", "学生", "学生", "男孩", "男孩", "老师"],
                                             "教授":["同学", "学生", "敲"],
                                             "写":["同学", "学生", "手写板", "手写板", "男孩", "笔", "笔记本", "纸"],
                                             "辅导":["同学", "学生", "男孩", "老师"],
                                             "袜子":["后退", "女人", "妻子", "洗衣机", "皮鞋", "脚", "跑", "进"],
                                             "恶心":["吐", "头痛", "蟑螂"],
                                             "用力":["吞", "吸", "吹", "打", "扶", "抓", "摇", "撕", "敲", "锻炼", "闻"],
                                             "兔子":["听", "胡萝卜", "青菜"],
                                             "音乐":["听", "果汁", "水", "汽水", "玩手机", "耳朵", "雨", "雨天", "雪", "雷电"],
                                             "耳机":["听", "平板电脑", "手机", "笔记本电脑"],
                                             "音响":["听", "学校", "广场", "浴室", "街"],
                                             "耳朵":["听", "平板电脑", "广场", "手机", "电脑", "笔记本电脑", "耳机"],
                                             "吹":["吹风机", "吹风机", "夏季", "雾", "风", "风扇"],
                                             "牙齿":["咬", "嚼", "小孩", "汽水", "牙刷", "牙刷", "牙膏", "牙膏", "男孩", "糖果"],
                                             "耐心":["售货员", "护士", "服务员", "理疗师", "社工", "维修工", "老师"],
                                             "逛街":["售货员", "姐妹", "姐妹", "姐妹", "朋友", "朋友", "果汁", "汽水"],
                                             "混凝土":["商店", "学校", "广场", "药店", "银行"],
                                             "酒吧":["喝", "杯子", "果汁", "水", "汽水", "牛奶", "酒"],
                                             "下班":["回家", "家", "平板电脑", "清洁工"],
                                             "骑车":["回家", "外卖员", "腿", "自行车", "袖子", "袖子", "路"],
                                             "晚餐":["回家", "玩手机", "羊肉", "蛋黄", "说话", "酒", "闻", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "毛线":["围巾", "地毯", "帽子", "毛衣"],
                                             "系紧":["围巾", "头绳", "鞋带", "领带", "飞机"],
                                             "冰箱":["地板", "女人", "妻子", "家", "拿", "煮锅", "煮锅", "碗", "羊肉", "香肠", "香菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "柜子":["地板", "拖鞋", "拿", "毛毯", "门口", "靴子"],
                                             "茶几":["地板", "地毯", "擦"],
                                             "水泥":["地板", "墙壁", "家", "街", "路"],
                                             "虫子":["地毯", "床", "抽屉", "枕头", "柜子", "毛巾", "毛毯", "牙刷", "牙膏", "蚂蚁", "蟑螂", "面条", "鸟"],
                                             "门":["地毯", "墙壁", "推", "敲", "门口"],
                                             "粗糙":["地毯", "手套", "树枝", "梨", "洗手池"],
                                             "支撑":["墙壁", "树干", "树枝", "窗边", "胸罩", "脖子", "脚", "腿"],
                                             "遮阳":["墨镜", "帽子", "树", "树林"],
                                             "防晒":["墨镜", "外套", "袖子"],
                                             "口罩":["墨镜", "脸", "鼻子", "鼻子"],
                                             "歌手":["墨镜", "眼镜", "耳机"],
                                             "中暑":["夏季", "水", "汽水"],
                                             "海边":["夏季", "脚", "腿"],
                                             "裙子":["夏季", "大腿", "女人", "女儿", "女孩", "妻子", "春季", "腿", "花", "靴子", "风"],
                                             "防晒霜":["夏季", "太阳", "晴天"],
                                             "西瓜":["夏季", "拍", "果汁"],
                                             "庆祝":["外公", "外婆", "奶奶", "抱", "敲", "酒"],
                                             "驼背":["外公", "外婆", "奶奶", "老人", "背"],
                                             "盆栽":["外公", "外婆", "奶奶", "客厅", "花", "阳台"],
                                             "鱼":["外公", "外婆", "奶奶", "猫", "老人", "腹部", "螃蟹", "鱼肉", "鸟"],
                                             "鸟":["外公", "外婆", "奶奶", "树枝", "老人", "飞机", "飞机"],
                                             "中风":["外公", "外婆", "奶奶", "爷爷"],
                                             "老年病":["外公", "外婆", "奶奶", "爷爷"],
                                             "脑卒中":["外公", "奶奶", "爷爷"],
                                             "阿尔兹海默症":["外公", "外婆", "奶奶", "爷爷", "老人"],
                                             "骨质疏松":["外公", "外婆", "奶奶", "爷爷", "老人"],
                                             "严肃":["外公", "姑父", "母亲", "父亲", "男人", "药店", "银行"],
                                             "固执":["外公", "母亲", "爷爷", "男人", "老人"],
                                             "慈祥":["外公", "外婆", "奶奶", "父亲", "爷爷", "老人"],
                                             "按摩":["外公", "外婆", "头痛", "奶奶", "姐妹", "感冒", "按摩", "朋友", "淤青", "淤青", "胃痛", "背", "背", "胸", "脖子", "脚", "脚", "脸", "脸", "腰"],
                                             "收音机":["外公", "外公", "外婆", "外婆", "奶奶", "奶奶", "爷爷", "老人"],
                                             "电视机":["外公", "外公", "外婆", "外婆", "女人", "奶奶", "奶奶", "妻子", "客厅", "爷爷", "老人"],
                                             "书法":["外公", "外婆", "奶奶", "爷爷"],
                                             "戏曲":["外公", "外婆", "奶奶", "爷爷"],
                                             "拐杖":["外公", "外婆", "奶奶", "爷爷", "老人", "走"],
                                             "眼镜":["外公", "外婆", "奶奶", "学习", "看", "眼睛", "老人"],
                                             "老人机":["外公", "外婆", "奶奶", "老人"],
                                             "电动车":["外卖员", "快递员", "维修工", "袖子"],
                                             "小区":["外卖员", "老人", "邻居"],
                                             "外卖":["外卖员", "家", "袖子", "门口", "门口"],
                                             "防止":["外套", "大衣", "毛衣", "秋衣"],
                                             "衣柜":["外套", "大衣", "女人", "妻子", "毛衣", "背心"],
                                             "牛仔":["外套", "短裤", "衬衣", "长裤"],
                                             "抬":["大腿", "小腿", "救护车"],
                                             "体温":["大腿", "头", "小腿", "屁股", "手", "手指", "手肘", "手腕", "眼睛", "耳朵", "背", "胳膊", "胸", "脖子", "脚", "脸", "腰", "腹部", "腿", "鼻子"],
                                             "小腿":["大腿", "袜子", "靴子"],
                                             "腰":["大腿", "屁股", "捡", "药膏"],
                                             "飞机":["天空", "手机", "桌子", "椅子", "灯", "空调", "窗户", "笔记本电脑", "镜子", "门", "雾", "马桶", "鸟"],
                                             "热水器":["太阳", "太阳", "晴天", "沐浴露", "洗澡"],
                                             "球形":["太阳", "巧克力", "星星", "月", "月亮", "柠檬", "梨", "樱桃", "橙子", "洋葱", "火龙果", "番茄", "白菜", "芒果", "苹果", "菠萝", "西瓜"],
                                             "白天":["太阳", "晴天", "桌子", "椅子", "沙发", "窗户", "茶几", "袜子", "门"],
                                             "发热":["太阳", "感冒", "星星", "雷电"],
                                             "伞":["太阳", "客厅", "雨", "雨", "雨天", "雨天", "雪"],
                                             "扭动":["头", "脖子", "脚", "转身"],
                                             "中医":["头痛", "感冒", "按摩", "药膏"],
                                             "针灸":["头痛", "季节", "感冒", "脖子"],
                                             "玫瑰":["女人", "妻子", "背"],
                                             "坚强":["女人", "妻子", "姐妹", "母亲"],
                                             "大方":["女人", "妻子", "姐妹", "母亲", "父亲", "男人"],
                                             "开朗":["女人", "妻子", "姐妹", "母亲"],
                                             "直率":["女人", "妻子", "姐妹", "母亲", "男人"],
                                             "细":["女人", "姐妹", "树枝", "母亲", "牙刷", "胳膊", "脖子", "腿", "虾", "面条", "鞋带"],
                                             "腼腆":["女人", "姐妹", "母亲", "男人"],
                                             "高贵":["女人", "姐妹", "葡萄"],
                                             "魅力":["女人", "妻子", "姐妹", "母亲"],
                                             "微波炉":["女人", "妻子", "玉米", "碗"],
                                             "美容":["女人", "妻子", "姐妹", "朋友", "脸", "脸", "鼻子", "鼻子"],
                                             "桌游":["女人", "母亲", "父亲", "男人"],
                                             "上衣":["女人", "妻子", "胸罩", "腹部"],
                                             "丝袜":["女人", "妻子", "腿", "靴子"],
                                             "内衣":["女人", "妻子", "沐浴露", "洗发露", "洗面奶", "胸", "腹部"],
                                             "外套":["女人", "妻子", "风"],
                                             "衬衫":["女人", "妻子", "领带"],
                                             "化妆品":["女人", "妻子", "姐妹", "脸"],
                                             "卫生巾":["女人", "妻子", "母亲", "腹部"],
                                             "公园":["女孩", "树干", "狗", "老人", "花", "草", "鸟"],
                                             "晚辈":["姐妹", "舅妈", "舅舅", "阿姨"],
                                             "幽默":["姐妹", "朋友", "父亲", "男人"],
                                             "红包":["姑姑", "姑父", "爷爷"],
                                             "唠叨":["婶婶", "老人", "阿姨"],
                                             "努力":["学习", "清洁工", "锻炼"],
                                             "教练":["学习", "背", "运动鞋"],
                                             "读书":["学生", "灯", "男孩"],
                                             "汗水":["客厅", "背", "背心", "脸"],
                                             "保姆":["家", "果汁", "柠檬", "梨", "樱桃", "橙子", "汽水", "煮锅", "爷爷", "牛奶", "碗", "老人", "老鼠", "苍蝇", "虫", "酒", "酸奶"],
                                             "矮":["小孩", "楼梯", "男孩"],
                                             "近":["小孩", "男孩", "眼睛", "眼镜"],
                                             "动画片":["小孩", "牙刷", "狗", "猫"],
                                             "打":["屁股", "敲", "蟑螂"],
                                             "下午":["工作", "茶", "阳台"],
                                             "脆":["巧克力", "洋葱", "洗手池", "玉米", "白菜", "白萝卜", "笔", "苹果", "西兰花", "西瓜", "豆角", "青椒", "香菜", "鸡肉", "黄瓜"],
                                             "糖":["巧克力", "汽水", "汽水", "番茄", "酸奶", "鱼"],
                                             "钓鱼":["帽子", "爷爷", "虾", "鱼"],
                                             "比赛":["帽子", "男孩", "秒钟", "背心", "草", "运动鞋"],
                                             "脏":["平底锅", "枕头", "毛巾", "牙齿", "碗", "蟑螂", "袖子"],
                                             "锅铲":["平底锅", "螃蟹", "鸡蛋"],
                                             "上网":["平板电脑", "手机", "母亲", "父亲", "电脑", "男人", "笔记本电脑"],
                                             "记录":["平板电脑", "手写板", "看书", "血糖仪"],
                                             "听":["平板电脑", "手机", "打电话", "玩手机", "电脑", "电视机", "笔记本电脑", "耳朵", "耳朵"],
                                             "点击":["平板电脑", "手机", "玩手机", "电脑"],
                                             "触摸":["平板电脑", "手机", "胳膊"],
                                             "白领":["平板电脑", "手写板", "电脑", "皮鞋", "笔记本电脑", "背包", "脖子"],
                                             "销售员":["平板电脑", "手机", "洗衣机", "电视机", "空调", "笔记本电脑", "风扇"],
                                             "泡面":["平板电脑", "电视机", "笔记本电脑"],
                                             "零食":["平板电脑", "电视机", "看电视", "笔记本电脑", "糖果", "闻", "饼干"],
                                             "时间":["年", "微波炉", "星期", "秒钟"],
                                             "勇敢":["年轻人", "父亲", "男人"],
                                             "开放":["年轻人", "广场", "床单", "床单", "抽屉", "毛巾", "毛毯", "毛毯", "纸", "背包", "菜市场", "街", "被子", "被子", "路", "郊外", "餐巾"],
                                             "折叠":["床单", "毛巾", "毛巾", "毛毯", "毛毯"],
                                             "油":["开塞露", "毛巾", "脸", "面条"],
                                             "腰带":["弯腰", "腰", "转身"],
                                             "调节":["微波炉", "电视机", "空调", "风扇"],
                                             "捕捞":["扇贝", "虾", "螃蟹", "鱼"],
                                             "渔民":["扇贝", "虾", "螃蟹", "鱼"],
                                             "粉丝":["扇贝", "猪肉", "蚂蚁", "螃蟹"],
                                             "打扫":["手套", "护工", "蟑螂", "邻居"],
                                             "搬运":["手套", "树干", "社工", "蚂蚁"],
                                             "抹布":["手套", "洗手池", "清洁工"],
                                             "骨头":["手套", "牙齿", "猪肉", "背", "胳膊", "脖子", "脚", "脸", "腿", "膝盖", "鼻子"],
                                             "按下":["手指", "电梯", "电视机"],
                                             "办公":["手机", "桌子", "椅子", "沙发", "电脑", "笔记本电脑", "笔记本电脑", "茶几"],
                                             "女朋友":["手机", "牛油果", "生姜"],
                                             "日常":["手机", "打电话", "胸罩"],
                                             "彩色":["手机", "电脑", "自行车", "蘑菇"],
                                             "运动员":["扔", "毛巾", "背心", "脚", "腿", "膝盖", "药膏", "跑", "运动鞋", "香蕉"],
                                             "肚子":["拍", "胃痛", "腹部"],
                                             "室友":["拖鞋", "毛巾", "洗手池", "洗衣机", "洗面奶", "电梯", "空调", "背心", "袖子", "门口"],
                                             "客厅":["拖鞋", "桌子", "椅子", "毛毯", "沙发", "灯", "窗户", "茶几", "茶壶", "镜子", "门", "饼干"],
                                             "收回":["拿", "胳膊", "踢"],
                                             "剪":["指甲", "树枝", "脚"],
                                             "透明":["指甲", "杯子", "碗", "窗边", "花瓶", "茶几", "鸡蛋"],
                                             "船":["摇", "树干", "桌子", "椅子", "灯", "皮鞋", "窗户", "运动鞋", "镜子", "门", "香肠", "香蕉", "马桶", "鱼", "鱼肉"],
                                             "去除":["撕", "牙膏", "牛油果", "芒果", "鼻子"],
                                             "捏":["撕", "纸巾", "肥皂", "被子", "餐巾"],
                                             "苹果":["擦", "果汁", "梨"],
                                             "担架":["救护车", "楼梯", "电梯"],
                                             "痛":["敲", "腹部", "腹部", "腿"],
                                             "望远镜":["星星", "月亮", "阳台"],
                                             "诗歌":["春季", "晚上", "月", "秋季"],
                                             "烧烤":["晚上", "柠檬", "羊肉", "羊肉", "茄子", "茄子", "香菜", "香菜"],
                                             "弯曲":["月", "胳膊", "蹲下", "香蕉"],
                                             "保安":["服务员", "清洁工", "维修工", "银行"],
                                             "经理":["服务员", "清洁工", "皮鞋", "茶"],
                                             "水壶":["杯子", "柠檬", "梨", "樱桃", "橙子"],
                                             "潮湿":["枕头", "浴室", "雨", "雨", "雨天", "雨天", "雪", "雪"],
                                             "变质":["果汁", "柠檬", "梨", "樱桃", "橙子", "牛奶", "酸奶"],
                                             "减肥":["果汁", "牛油果", "西兰花", "鱼肉", "鸡肉", "黄瓜"],
                                             "糖尿病":["果汁", "汽水", "爷爷", "米饭", "糖果", "老人", "香蕉"],
                                             "榨汁":["果汁", "果汁", "柠檬", "柠檬", "梨", "梨", "樱桃", "樱桃", "橙子", "橙子", "水", "火龙果", "芒果", "苹果", "菠萝", "葡萄", "西瓜", "香蕉", "黄瓜"],
                                             "湿":["果汁", "毛巾", "毛毯", "水", "汽水", "牛奶", "蛋黄", "酒", "酸奶", "雾"],
                                             "流动":["果汁", "水", "汽水", "沐浴露", "洗发露", "洗面奶", "牙膏", "牛奶", "酒", "酸奶"],
                                             "橙色":["果汁", "橙子", "汽水", "胡萝卜", "鸡蛋"],
                                             "掉落":["柠檬", "梨", "樱桃", "橙子"],
                                             "调味":["柠檬", "青椒", "香菜"],
                                             "摆放":["柠檬", "梨", "橙子"],
                                             "弹性":["柠檬", "樱桃", "橙子", "袖子", "运动鞋", "香肠"],
                                             "浇水":["树", "花", "草"],
                                             "叶子":["树", "树枝", "茶", "蚂蚁"],
                                             "粗":["树干", "树枝", "白萝卜", "胳膊", "脖子", "腿"],
                                             "森林":["树干", "树干", "树枝", "社工", "花", "草", "草", "蚂蚁", "鸟"],
                                             "家具":["树干", "桌子", "椅子", "沙发", "浴缸", "灯", "窗户", "茶几", "镜子", "门", "马桶"],
                                             "绘画":["树枝", "花", "虾"],
                                             "地面":["树枝", "纸", "跑"],
                                             "书房":["桌子", "椅子", "灯", "窗户", "门"],
                                             "凳子":["桌子", "椅子", "沙发"],
                                             "搬家":["桌子", "桌子", "椅子", "椅子", "沙发", "沙发", "浴缸", "灯", "窗户", "窗户", "茶几", "茶几", "镜子", "门", "门", "马桶"],
                                             "温度":["桌子", "椅子", "沙发", "灯", "银行", "门"],
                                             "家庭主妇":["桌子", "椅子", "沙发", "浴缸", "灯", "窗户", "羊肉", "茶几", "蛋黄", "镜子", "门", "香肠", "香菜", "香蕉", "马桶", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "沙拉":["梨", "樱桃", "橙子", "牛油果", "西兰花", "酸奶"],
                                             "邻居":["楼梯", "水", "狗", "猫", "电梯"],
                                             "高":["楼梯", "男孩", "鼻子"],
                                             "上楼":["楼梯", "电梯", "邻居"],
                                             "下楼":["楼梯", "电梯", "邻居"],
                                             "爬":["楼梯", "老鼠", "虫", "蟑螂"],
                                             "卡通":["樱桃", "狗", "猫", "菠菜", "豆角"],
                                             "唱歌":["母亲", "父亲", "男人", "胡萝卜"],
                                             "遛狗":["母亲", "父亲", "爷爷", "男人", "老人"],
                                             "香皂":["毛巾", "毛毯", "沐浴露"],
                                             "浴室":["毛巾", "沐浴露", "洗发露", "洗脚盆", "洗面奶", "牙刷", "牙膏", "背", "胸", "脸盆"],
                                             "干":["毛巾", "毛毯", "羊肉", "香肠"],
                                             "无味":["水", "胶囊", "药", "药片", "通心粉", "饼"],
                                             "物业":["水", "电梯", "社工", "邻居"],
                                             "配送员":["水", "羊肉", "香肠", "香菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "无色":["水", "酒", "雨"],
                                             "果汁":["水", "电视机", "芒果", "菠萝", "葡萄", "西瓜"],
                                             "辣":["汽水", "洋葱", "生姜", "瘙痒", "白萝卜", "羊肉", "胃痛", "酒", "青椒", "面条", "鱼肉", "鸡肉"],
                                             "粉色":["汽水", "胸", "脸", "药片"],
                                             "紫色":["汽水", "洋葱", "洗脚盆", "淤青", "玉米", "脸盆", "茄子", "葡萄"],
                                             "挤出":["沐浴露", "洗发露", "洗面奶", "牙膏", "药膏"],
                                             "揉搓":["沐浴露", "洗发露", "洗面奶"],
                                             "闻":["沐浴露", "花", "茶"],
                                             "过敏":["沐浴露", "洗发露", "洗面奶", "瘙痒", "芒果", "蚊子", "香菜"],
                                             "广告":["沐浴露", "洗发露", "牙刷", "牙膏", "电梯"],
                                             "泡沫":["沐浴露", "洗发露", "洗面奶"],
                                             "市场":["洋葱", "生姜", "番茄", "白菜", "白萝卜", "羊肉", "胡萝卜", "茄子", "菠菜", "蘑菇", "西兰花", "豆角", "青椒", "青菜", "香肠", "香菜", "香蕉", "香蕉", "鱼", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "小贩":["洋葱", "火龙果", "牛油果", "牛肉", "猪肉", "玉米", "生姜", "番茄", "白菜", "白萝卜", "胡萝卜", "芒果", "苹果"],
                                             "臭":["洗手池", "牙齿", "老鼠", "脚", "菜市场", "蟑螂", "袜子", "闻", "靴子", "马桶", "鱼", "鸡蛋"],
                                             "水龙头":["洗手池", "洗脚盆", "脸盆"],
                                             "沐浴露":["洗澡", "浴室", "背"],
                                             "受伤":["淤青", "淤青", "脚", "脸", "腿", "膝盖", "药膏"],
                                             "疼痛":["淤青", "胃痛", "胸", "脖子"],
                                             "切块":["火龙果", "芒果", "菠萝", "西瓜"],
                                             "去皮":["火龙果", "番茄", "芒果"],
                                             "果园":["火龙果", "芒果", "苹果"],
                                             "下午茶":["火龙果", "芒果", "苹果", "菠萝", "葡萄", "西瓜", "闻"],
                                             "饭后":["火龙果", "芒果", "苹果"],
                                             "多汁":["火龙果", "番茄", "白萝卜", "芒果", "苹果", "葡萄", "鸡肉", "黄瓜"],
                                             "牛":["煮锅", "牛肉", "香肠"],
                                             "猪":["煮锅", "猪肉", "香肠"],
                                             "鸡":["煮锅", "蛋黄", "香肠", "鸡肉", "鸡蛋"],
                                             "抠门":["父亲", "男人", "舅妈"],
                                             "骨折":["爷爷", "矫正板", "老人", "胳膊", "腿", "鼻子"],
                                             "高血压":["爷爷", "老人", "血压仪", "酒"],
                                             "腻":["牛奶", "猪肉", "面条"],
                                             "好吃":["牛肉", "猪肉", "虾", "螃蟹", "面条", "鱼", "鸡蛋"],
                                             "难吃":["牛肉", "猪肉", "虾", "鸡蛋"],
                                             "熟":["牛肉", "猪肉", "玉米", "羊肉", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "蛋黄", "螃蟹", "西兰花", "西瓜", "豆角", "青椒", "青菜", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "生":["牛肉", "猪肉", "玉米", "羊肉", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "蚊子", "蛋黄", "螃蟹", "西兰花", "西瓜", "豆角", "青椒", "青菜", "香菜", "香蕉", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "肥":["牛肉", "狗", "猪肉", "猫", "老鼠", "螃蟹"],
                                             "叫":["狗", "猫", "老鼠"],
                                             "斑点":["狗", "蚊子", "香蕉"],
                                             "剥":["玉米", "螃蟹", "鸡蛋"],
                                             "卖出":["玉米", "螃蟹", "鸡蛋"],
                                             "种植":["玉米", "花", "茄子", "草", "菠菜", "菠萝", "葡萄", "蘑菇", "西瓜", "豆角", "青菜"],
                                             "农田":["玉米", "茄子", "菠菜", "菠萝", "葡萄", "蘑菇", "虾", "螃蟹", "西兰花", "西瓜", "豆角", "青椒", "青菜", "鱼"],
                                             "新鲜":["玉米", "虾", "虾", "蚂蚁", "螃蟹", "黄瓜"],
                                             "维修":["电视机", "维修工", "维修工", "风扇"],
                                             "主妇":["番茄", "白菜", "白萝卜", "胡萝卜"],
                                             "豆腐":["白菜", "被子", "青菜"],
                                             "火锅":["白萝卜", "纸巾", "香菜"],
                                             "粗略":["看", "穿衣服", "穿鞋"],
                                             "工位":["笔", "笔记本", "纸"],
                                             "竹子":["笔记本", "筷子", "筷子", "纸", "纸巾", "餐巾"],
                                             "主食":["米饭", "通心粉", "面包", "饼", "馒头"],
                                             "烤箱":["羊肉", "蛋糕", "面包", "饼干", "香肠", "鱼肉", "鸡肉", "鸭肉"],
                                             "点菜":["羊肉", "蛋黄", "香肠", "香菜", "鱼肉", "鸡肉", "鸭肉", "黄瓜"],
                                             "猫":["老人", "老鼠", "黄瓜"],
                                             "风湿病":["老人", "雨", "雨天", "雪"],
                                             "下水道":["老鼠", "蚂蚁", "蟑螂"],
                                             "消化":["胃痛", "苹果", "菠菜", "酸奶", "酸奶"],
                                             "肌肉":["背", "胳膊", "胸", "脖子", "脚", "脸", "腹部", "腿", "膝盖", "高肌张力", "鼻子"],
                                             "血管":["背", "胳膊", "胸", "脖子", "脚", "脸", "腹部", "腿", "膝盖", "鼻子"],
                                             "干涩":["胶囊", "药片", "饼干"],
                                             "飞":["苍蝇", "虫", "蟑螂", "鸟"],
                                             "促进":["苹果", "菠菜", "青椒"],
                                             "江河":["虾", "螃蟹", "鱼"],
                                             "死":["虾", "蚂蚁", "蚊子", "螃蟹"],
                                             "面粉":["蛋糕", "通心粉", "面包", "面条", "饼", "饼干", "馒头"],
                                             "青色":["螃蟹", "青椒", "青菜", "鱼"],
                                             "嫩":["西兰花", "豆角", "青菜", "鱼"],
                                             "小麦":["通心粉", "面包", "饼", "饼干", "馒头"],
                                             "阴":["雨", "雨天", "雪"],
]
    var someDict:[String:Int] = ["有什么特征":0,"出现的地点":1,"出现的时间":2,"发生的行为":3,"关联的事件":4,"相关的人":5,"相关的事物":6,"":3,"人的特征":0,"行为的特征":1,"事物的特征":2,"职业":7,"人际关系":8,"饮食":9,"医疗健康":10,"生活用品":11,"文娱产品":12,"身体部位":13,"交通工具":14,"家居":15,"服饰":16,"动植物":17,"天气情况":18,"年龄":0,"品质性格":1,"体型身材":2,"性别":3,"程度":4,"速度":5,"材质":6,"体积大小":7,"温度":8,"形状":9,"颜色":10,"重量":11,"状态":12,]
    
    
    //chooseCollectionView数据
    var tempWord = "我"
    var tempColorIndex = 0
    var tempPos = 0
    let chooseData = ["人物与指代","地点Btn","服饰Btn","饮食Btn","医疗健康Btn","身体部位Btn","生活用品Btn","家居Btn","动植物Btn","交通工具Btn","时间词","天气Btn"]
    var choosedData = ["我"]
    var choosedColor = [0]
    
    let chooseDataRows = [["人称代词","数量指代","人际关系","职业"],["所处指代","室内","户外"],["服装","鞋与配饰"],
                          ["生活用品","电子产品"],["病症","药品","医疗器材与手段"],["身体部位"],["家具","家用电器"],
                          ["主食与糕点","饮品","蔬果","荤肉","水产"],["动物","植物"],["交通工具"],["时间"],["天气"],
                          ["动作","想法与能力","时态","活动"],["数目","颜色","状态","范围","程度","度量"],["连接词","语气与情形","时间与频率","介词"],["语气词"]]
    let btnTitle = ["人物与指代","地点","服饰","饮食","医疗健康","身体部位","生活用品","家居","动植物","交通工具","时间","天气","活动","修饰","关联性","语气词"]
    let images=[[["你","你们","他","他们","它","她","她们","我","我们","谁"],
                 ["那个","那些","全部","这个","这些","哪个","哪些"],
                 ["儿子","父亲","姑父","姑姑","家人","姐妹","舅舅","舅妈","老人","邻居","母亲","奶奶","男孩","阿姨"
                  ,"男人","年轻人","女儿","女孩","女人","朋友","妻子","婶婶","同学","外公","外婆","外甥","外甥女"
                  ,"小孩","兄弟","学生","爷爷","姨父","姨妈","丈夫","侄子","侄女"],
                 ["保姆","服务员","护工","护士","快递员","老师","理疗师","清洁工","社工","售货员","司机","外卖员","维修工","医生","维修工"]
                ],
                [["那边","那儿","那里","这边","这里","这儿","怎么","什么","哪里","哪儿"],
                 ["厨房","窗边","电梯","家","客厅","楼梯","门口","卫生间","卧室","阳台","浴室"],
                 ["菜市场","公园","广场","护理中心","郊外","街","路","商店","书店","停车场","学校","药店","医院","银行"]
                ],
                [["背心","衬衣","大衣","短裤","毛衣","内衣","秋衣","裙子","睡衣","外套","卫衣","袖子","长裤","T恤","袖子"],
                 ["背包","发箍","发卡","口袋","口罩","凉鞋","领带","帽子","墨镜","皮鞋","手套","头绳","拖鞋","袜子"
                  ,"围巾","鞋带","胸罩","靴子","眼镜","运动鞋","袖子"]
                ],
                [["杯子","被子","笔","笔记本","餐巾","叉子","茶壶","床单","刀子","肥皂","花瓶","口红","筷子","脸盆"
                  ,"毛巾","毛毯","沐浴露","钱","平底锅","勺子","手写板","碗","洗发露","洗脚盆","洗面奶","牙膏","牙刷",
                  "枕头","纸","纸巾","煮锅"],
                 ["笔记本电脑","充电器","电脑","耳机","平板电脑","手机","剃须刀","电影","密码","遥控器","音乐"]
                ],
                [["发烧","感冒","咳嗽","肌张力高","喷嚏","瘙痒","头痛","头晕","胃痛","淤青","生病"],
                 ["胶囊","开塞露","药","药膏","药片","中药"],
                 ["按摩","矫正板","康复训练","口罩","轮椅","血糖仪","血压仪"]
                ],
                [["背","鼻子","脖子","大腿","耳朵","腹部","胳膊","肩膀","脚","脚跟","脚踝","脸","屁股","手","手腕"
                  ,"手指","手肘","头","头发","腿","膝盖","下巴","小腿","胸","牙齿","眼睛","腰","指甲","嘴巴","身体"]
                ],
                [["茶几","抽屉","窗户","床","地板","地毯","灯","柜子","镜子","马桶","门","墙壁","沙发","书架"
                  ,"洗手池","椅子","浴缸","桌子"],
                 ["冰箱","吹风机","电视机","风扇","空调","微波炉","洗衣机"]
                ],
                [["包子","饼","饼干","蛋糕","饺子","馒头","米饭","面包","面条","巧克力","糖果","通心粉","香肠","菜单","食物"],
                 ["茶","果汁","酒","咖啡","可乐","牛奶","汽水","水","酸奶"],
                 ["白菜","白萝卜","菠菜","菠萝","橙子","豆角","番茄","胡萝卜","黄瓜","火龙果","茄子","梨","芒果","蘑菇",
                  "南瓜","柠檬","牛油果","苹果","葡萄","青菜","青椒","生姜","土豆","西瓜","西兰花","香菜","香蕉",
                  "洋葱","樱桃","玉米"],
                 ["蛋黄","鸡蛋","鸡肉","牛肉","香肠","鸭肉","羊肉","猪肉"],
                 ["螃蟹","扇贝","虾","鱼肉"]
                ],
                [["苍蝇","虫","狗","老鼠","蚂蚁","猫","鸟","蚊子","鱼","蟑螂"],
                 ["草","花","树","树干","树林","树枝","叶子"]
                ],
                [["车","出租车","飞机","公共汽车","火车","救护车","轮椅","自行车"]
                ],
                [["春季","冬季","分钟","季节","秒钟","年","秋季","上午","晚上","下午","夏季","小时","星期","月","中午","时间"]
                ],
                [["风","雷电","晴天","台风","太阳","天空","雾","星星","雪","阴天","雨","雨天","月亮","云"]
                ],
                [["按","抱","擦","插","尝","唱","吃","吹","打","低头","蹲下","发现","感觉","给","关","喝","呼吸",
                  "画","捡","剪","进","嚼","开","看","哭","来","买","拿","挠","跑","敲","去","扔","睡觉","说",
                  "撕","躺下","踢","跳","听","吐","推","吞","闻","问","吸","洗","笑","写","摇","咬","站","抓",
                  "转身","走","clap","帮","切","选","觉得","上","下","后退","弯腰","拍","抬头"],
                 ["不是","不喜欢","没有","是","喜欢","想","用","有","抱歉","同意","谢谢","知道","能","能够","会","想要","要","可","可以"],
                 ["到","过","将","了","完","在","着"],
                 ["乘车","吃饭","吃药","出门","穿鞋","穿衣服","打电话","等待","锻炼","工作","喝水","回家","看电视",
                  "看书","理发","起床","去医院","上厕所","上楼","视频","刷牙","睡觉","说话","脱鞋","脱衣服","玩手机",
                  "午睡","洗脸","洗头","洗澡","下楼","休息","学习","打针","挂号","检查","拍照","上班"]
                ],
                [["零","一","二","两","三","四","五","六","七","八","九","十","百","千","万","许多","一些","全部","多","少","多少","再"],
                 ["白色","彩色","橙色","粉色","黑色","红色","黄色","灰色","金色","蓝色","绿色","透明","银色","紫色",
                 "棕色"],
                 ["好","坏","冷","暖","热","冰","温","一般","快","慢","累","困","饿","舒服","难受","疼","长",
                  "短","中等","大","小","贵","伤心","生气"],
                 ["只有","一起","都","别的"],
                 ["很","最","太","更","比较","相当","一下","特别"],
                 ["张","座","个","条","顶","棵","只","条","辆","本","件","首","两","斤","公斤","米","寸","勺","盘"
                  ,"碗","桶","盆","杯","瓶","箱","袋","篮","年","月","日","点","周","天","分","秒","岁","粒","幢"
                  ,"堆","条","根","片","面","块"]
                ],
                [["和","虽然","尽管","即使","再说","无论","都","只有","只要","甚至","而且","就","于是","却","但是","不过"
                  ,"不然","原来","为了","因为","所以","因此","除了","包括","或者","不是","就是","如果","要是","像","比",
                  "似乎","不如"],
                 ["一定","却","就","难道","幸亏","反正","也许","大约","好像","几乎","还是"],
                 ["刚","将要","总是","已经","正在","马上","一直","忽然","有时"],
                 ["从","向","以","对","被","让","把"]
                ],
                [["呢","吧","啊","吗"]
                ]
                
    ]
    
    let wordsClass:[String:Int] = ["他":0,"他们":0,"你":0,"你们":0,"她":0,"她们":0,"它":0,"我":0,"我们":0,"谁":0,"全部":0,"这个":0,"这些":0,"那个":0,"那些":0,"哪个":0,"哪些":0,"什么":0,"怎么":0,"丈夫":0,"儿子":0,"兄弟":0,"同学":0,"外公":0,"外婆":0,"女人":0,"女儿":0,"女孩":0,"奶奶":0,"妻子":0,"姐妹":0,"姑姑":0,"姑父":0,"学生":0,"家人":0,"小孩":0,"年轻人":0,"朋友":0,"母亲":0,"父亲":0,"爷爷":0,"男人":0,"男孩":0,"老人":0,"侄子":0,"侄女":0,"外甥":0,"外甥女":0,"阿姨":0,"叔叔":0,"婶婶":0,"舅舅":0,"舅妈":0,"邻居":0,"保姆":0,"医生":0,"司机":0,"售货员":0,"快递员":0,"护士":0,"护工":0,"服务员":0,"清洁工":0,"理疗师":0,"社工":0,"维修工":0,"外卖员":0,"老师":0,"这儿":0,"这边":0,"这里":0,"那儿":0,"那边":0,"那里":0,"哪儿":0,"哪里":0,"卧室":0,"卫生间":0,"厨房":0,"客厅":0,"家":0,"楼梯":0,"浴室":0,"电梯":0,"窗边":0,"门口":0,"阳台":0,"书店":0,"停车场":0,"公园":0,"医院":0,"商店":0,"学校":0,"广场":0,"护理中心":0,"药店":0,"菜市场":0,"街":0,"路":0,"郊外":0,"银行":0,"T恤":0,"内衣":0,"外套":0,"大衣":0,"毛衣":0,"睡衣":0,"短裤":0,"秋衣":0,"背心":0,"衬衣":0,"袖子":0,"裙子":0,"长裤":0,"卫衣":0,"凉鞋":0,"发卡":0,"发箍":0,"口罩":0,"口袋":0,"围巾":0,"墨镜":0,"头绳":0,"帽子":0,"手套":0,"拖鞋":0,"皮鞋":0,"眼镜":0,"背包":0,"胸罩":0,"袜子":0,"运动鞋":0,"靴子":0,"鞋带":0,"领带":0,"钱":0,"刀子":0,"勺子":0,"手写板":0,"脸盆":0,"洗脚盆":0,"床单":0,"叉子":0,"口红":0,"平底锅":0,"杯子":0,"枕头":0,"毛巾":0,"毛毯":0,"沐浴露":0,"洗发露":0,"洗面奶":0,"煮锅":0,"牙刷":0,"牙膏":0,"碗":0,"笔":0,"笔记本":0,"筷子":0,"纸":0,"纸巾":0,"肥皂":0,"花瓶":0,"茶壶":0,"被子":0,"餐巾":0,"充电器":0,"剃须刀":0,"平板电脑":0,"手机":0,"电脑":0,"笔记本电脑":0,"耳机":0,"音乐":0,"电影":0,"密码":0,"遥控器":0,"生病":0,"发烧":0,"咳嗽":0,"喷嚏":0,"头晕":0,"头痛":0,"感冒":0,"淤青":0,"瘙痒":0,"胃痛":0,"高肌张力":0,"药":0,"中药":0,"药片":0,"胶囊":0,"药膏":0,"开塞露":0,"矫正板":0,"血糖仪":0,"血压仪":0,"轮椅":0,"康复训练":0,"按摩":0,"身体":0,"肩":0,"下巴":0,"嘴巴":0,"大腿":0,"头":0,"小腿":0,"屁股":0,"手":0,"手腕":0,"手肘":0,"手指":0,"眼睛":0,"耳朵":0,"背":0,"胳膊":0,"胸":0,"脖子":0,"腿":0,"脚":0,"脸":0,"腹部":0,"膝盖":0,"鼻子":0,"腰":0,"牙齿":0,"头发":0,"指甲":0,"书架":0,"地板":0,"地毯":0,"墙壁":0,"床":0,"抽屉":0,"柜子":0,"桌子":0,"椅子":0,"沙发":0,"洗手池":0,"浴缸":0,"灯":0,"窗户":0,"茶几":0,"镜子":0,"门":0,"马桶":0,"冰箱":0,"吹风机":0,"微波炉":0,"洗衣机":0,"空调":0,"电视机":0,"风扇":0,"食物":0,"菜单":0,"包子":0,"巧克力":0,"米饭":0,"糖果":0,"蛋糕":0,"通心粉":0,"面包":0,"面条":0,"饼":0,"饼干":0,"馒头":0,"香肠":0,"可乐":0,"咖啡":0,"果汁":0,"水":0,"汽水":0,"牛奶":0,"茶":0,"酒":0,"酸奶":0,"南瓜":0,"土豆":0,"柠檬":0,"梨":0,"樱桃":0,"橙子":0,"洋葱":0,"牛油果":0,"玉米":0,"生姜":0,"番茄":0,"白菜":0,"白萝卜":0,"胡萝卜":0,"火龙果":0,"芒果":0,"苹果":0,"茄子":0,"菠菜":0,"菠萝":0,"葡萄":0,"蘑菇":0,"西兰花":0,"西瓜":0,"豆角":0,"青椒":0,"青菜":0,"香菜":0,"香蕉":0,"黄瓜":0,"牛肉":0,"猪肉":0,"羊肉":0,"蛋黄":0,"鸡肉":0,"鸡蛋":0,"鸭肉":0,"扇贝":0,"虾":0,"螃蟹":0,"鱼肉":0,"狗":0,"猫":0,"老鼠":0,"苍蝇":0,"虫":0,"蚂蚁":0,"蚊子":0,"蟑螂":0,"鱼":0,"鸟":0,"叶子":0,"树":0,"树干":0,"树林":0,"树枝":0,"花":0,"草":0,"公共汽车":0,"出租车":0,"救护车":0,"火车":0,"自行车":0,"车":0,"飞机":0,"时间":0,"上午":0,"中午":0,"下午":0,"冬季":0,"分钟":0,"夏季":0,"季节":0,"小时":0,"年":0,"星期":0,"春季":0,"晚上":0,"月":0,"秋季":0,"秒钟":0,"云":0,"台风":0,"天空":0,"太阳":0,"星星":0,"晴天":0,"月亮":0,"阴天":0,"雨":0,"雨天":0,"雪":0,"雷电":0,"雾":0,"风":0,"看":1,"发现":1,"闻":1,"听":1,"说":1,"笑":1,"哭":1,"唱":1,"吃":1,"咬":1,"吞":1,"吐":1,"给":1,"帮":1,"选":1,"吸":1,"喝":1,"嚼":1,"切":1,"尝":1,"吹":1,"问":1,"买":1,"呼吸":1,"点头":1,"摇头":1,"低头":1,"抬头":1,"扶":1,"抱":1,"抓":1,"推":1,"挠":1,"拿":1,"撕":1,"捡":1,"洗":1,"打":1,"开":1,"关":1,"擦":1,"拍":1,"按":1,"敲":1,"插":1,"写":1,"画":1,"摇":1,"剪":1,"扔":1,"转身":1,"躺下":1,"睡觉":1,"蹲下":1,"弯腰":1,"后退":1,"进":1,"跑":1,"跳":1,"站":1,"踢":1,"走":1,"来":1,"去":1,"上":1,"下":1,"感觉":1,"觉得":1,"是":1,"不是":1,"有":1,"没有":1,"能":1,"能够":1,"会":1,"知道":1,"同意":1,"谢谢":1,"抱歉":1,"可":1,"可能":1,"可以":1,"用":1,"愿意":1,"宁愿":1,"喜欢":1,"不喜欢":1,"肯":1,"要":1,"想要":1,"敢":1,"应该":1,"得":1,"该":1,"犯不着":1,"值得":1,"方便":1,"很难":1,"了":1,"过":1,"到":1,"将":1,"在":1,"着":1,"完":1,"打针":1,"挂号":1,"检查":1,"拍照":1,"学习":1,"锻炼":1,"吃饭":1,"午睡":1,"工作":1,"休息":1,"看书":1,"看电视":1,"上班":1,"上楼":1,"下楼":1,"上厕所":1,"打电话":1,"洗澡":1,"刷牙":1,"洗脸":1,"洗头":1,"穿衣服":1,"脱衣服":1,"穿鞋":1,"脱鞋":1,"出门":1,"等待":1,"理发":1,"乘车":1,"去医院":1,"回家":1,"玩手机":1,"说话":1,"视频":1,"起床":1,"喝水":1,"吃药":1,"好":2,"坏":2,"冷":2,"暖":2,"热":2,"冰":2,"温":2,"一般":2,"快":2,"慢":2,"累":2,"贵":2,"伤心":2,"生气":2,"困":2,"饿":2,"舒服":2,"难受":2,"疼":2,"长":2,"短":2,"中等":2,"大":2,"小":2,"只有":2,"一起":2,"都":2,"别的":2,"很":2,"最":2,"太":2,"更":2,"比较":2,"相当":2,"一下":2,"特别":2,"许多":2,"一些":2,"多":2,"少":2,"多少":2,"再":2,"零":2,"一":2,"二":2,"两":2,"三":2,"四":2,"五":2,"六":2,"七":2,"八":2,"九":2,"十":2,"百":2,"千":2,"万":2,"张":2,"座":2,"个":2,"条":2,"顶":2,"棵":2,"只":2,"辆":2,"本":2,"件":2,"首":2,"斤":2,"公斤":2,"米":2,"寸":2,"勺":2,"盘":2,"桶":2,"盆":2,"杯":2,"瓶":2,"箱":2,"袋":2,"篮":2,"日":2,"点":2,"周":2,"天":2,"分":2,"秒":2,"岁":2,"粒":2,"幢":2,"堆":2,"根":2,"片":2,"面":2,"块":2,"和":3,"虽然":3,"尽管":3,"即使":3,"再说":3,"无论":3,"只要":3,"甚至":3,"而且":3,"就":3,"于是":3,"却":3,"但是":3,"不过":3,"不然":3,"原来":3,"为了":3,"因为":3,"所以":3,"因此":3,"除了":3,"包括":3,"或者":3,"就是":3,"如果":3,"要是":3,"像":3,"比":3,"似乎":3,"不如":3,"一定":3,"难道":3,"幸亏":3,"反正":3,"也许":3,"大约":3,"好像":3,"几乎":3,"还是":3,"刚":3,"将要":3,"总是":3,"已经":3,"正在":3,"马上":3,"一直":3,"忽然":3,"有时":3,"从":3,"向":3,"以":3,"对":3,"被":3,"让":3,"把":3,"呢":4,"吧":4,"啊":4,"吗":4]
    
    
    
    var chooseRow:Int = 0
    var chooseTop:Int = 0
    var len4Choosed:Int = 0{
        didSet{
            setBtnOutlet(able: (len4Choosed != 0))
        }
    }
    var len4Undo:Int = 0{
        didSet{
            setUndoBtnOutlet(able: (len4Undo != 0))
        }
    }
    var sentenceTitle = ""
    
    let synth = AVSpeechSynthesizer() //TTS对象
    let audioSession = AVAudioSession.sharedInstance() //语音引擎
    
    var center: CGPoint = CGPoint(x: 10,y: 10){
        didSet{
            selectView.center = center
            print("center has changed:"+center.debugDescription)
            print("selectView center is"+selectView.center.debugDescription)
            performSegue(withIdentifier: "toPopOver", sender: self)
        }
    }
    
    var wordCenter: CGPoint = CGPoint(x: 10, y: 10){
        didSet{
            wordSelectView.center = wordCenter
            print("word center has changed:"+wordCenter.debugDescription)
            print("word selectView center is"+selectView.center.debugDescription)
        }
    }
    
    
    override func viewDidLoad() {
        super.viewDidLoad()
        //collectionView数据与初始化
        chooseCollectionView.dataSource = self
        chooseCollectionView.delegate = self
        wordCollectionView.dataSource = self
        wordCollectionView.delegate = self
        //设置边框属性
        synth.delegate = self
        len4Choosed = choosedData.count
        len4Undo = 0
        clearBtn.setBackgroundImage(UIImage(named: "clear-disabled"), for: .disabled)
        playBtn.setBackgroundImage(UIImage(named: "play-disabled"), for: .disabled)
        deleteBtn.setBackgroundImage(UIImage(named: "return-disabled"), for: .disabled)
        // popoverPresentationController?.popoverLayoutMargins = .init(top: 0, left: 100, bottom: 100, right: 100)
        
        sportBtn.setBackgroundImage(UIImage(named: "活动-selected"), for: .selected)
        relationBtn.setBackgroundImage(UIImage(named: "关联性-selected"), for: .selected)
        decorationBtn.setBackgroundImage(UIImage(named: "修饰-selected"), for: .selected)
        toneBtn.setBackgroundImage(UIImage(named: "语气词-selected"), for: .selected)
        
        let panGesture = UIPanGestureRecognizer(target: self, action: #selector(handlePanGesture(_:)))
        wordCollectionView.addGestureRecognizer(panGesture)
        
        let longPressGesture = UILongPressGestureRecognizer(target: self, action: #selector(handleLongPressGesture(_:)))
        wordCollectionView.addGestureRecognizer(longPressGesture)
        
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
        
        mention.text = mentionData[0][0]
        mention.lineBreakMode = NSLineBreakMode.byWordWrapping
        mention.numberOfLines = 0
        history.append(0)
        
        //collectionView数据与初始化
        descriptionCollectionView.dataSource = self
        descriptionCollectionView.delegate = self
        let flowlayout = LastRowCenteredLayout()
        flowlayout.sectionInset = UIEdgeInsets(top: 10, left: 10, bottom: 10, right: 10)
        flowlayout.itemSize = CGSize(width: 104, height: 80)
        flowlayout.scrollDirection = .horizontal
        descriptionCollectionView.collectionViewLayout = flowlayout
        keyWordsCollectionView.dataSource = self
        keyWordsCollectionView.delegate = self
        let flowlayout2 = LastRowCenteredLayout()
        flowlayout2.sectionInset = UIEdgeInsets(top: 10, left: 10, bottom: 10, right: 10)
        flowlayout2.itemSize = CGSize(width: 130, height: 43)
        flowlayout2.scrollDirection = .horizontal
        keyWordsCollectionView.collectionViewLayout = flowlayout2
        self.keyWordsCollectionView.alwaysBounceHorizontal = true
        chooseWordCollectionView.dataSource = self
        chooseWordCollectionView.delegate = self
        self.chooseWordCollectionView.alwaysBounceHorizontal = true
        needHelp.alpha = 0.0
        lastStep.alpha = 0.0
        backtoTop.alpha = 0.0
        chooseWordCollectionView.isHidden = true
        // Do any additional setup after loading the view.
        setBorder()
        
    }
    
    override func prepare(for segue: UIStoryboardSegue, sender: Any?) {
         if segue.identifier == "toPopOver"{
             let controller = segue.destination as! PopOverViewController
             controller.titleText = chooseData[chooseRow]
             var data:[PopOverViewData] = []
             for i in 0..<chooseDataRows[chooseRow].count
             {
                 data.append(PopOverViewData(title: chooseDataRows[chooseRow][i], images: images[chooseRow][i]))
             }
             controller.datas = data
             controller.delegate = self
             controller.colorIndex = colorIndex(wordClass: chooseRow)
         }
        if segue.identifier == "btnToPop"{
            let controller = segue.destination as! PopOverBtnViewController
            controller.titleText = btnTitle[chooseRow]
            var data:[PopOverViewData] = []
            for i in 0..<chooseDataRows[chooseRow].count
            {
                data.append(PopOverViewData(title: chooseDataRows[chooseRow][i], images: images[chooseRow][i]))
            }
            controller.datas = data
            controller.delegate = self
            controller.colorIndex = colorIndex(wordClass: chooseRow)
        }
        if segue.identifier == "toSentence"{
            let controller = segue.destination as! SentenceViewController
            controller.titleText = sentenceTitle
        }
        if segue.identifier == "toWordPopOver"{
            let controller = segue.destination as! WordPopOverViewController
            controller.delegate = self
            controller.pos = tempPos
            controller.word = tempWord
            controller.colorIndex = tempColorIndex
            print("temp word is now " + controller.word)
        }
    }
    
    func colorIndex(wordClass:Int) -> Int{
        if(wordClass<=11){
            return 0
        }
        else if(wordClass == 12){
            return 1
        }
        else if(wordClass >= 13){
            return 2
        }
        return 0
    }
    
    // 设置失效与否
    func setBtnOutlet(able:Bool){
        clearBtn.isEnabled = able
        playBtn.isEnabled = able
    }
    
    func setUndoBtnOutlet(able:Bool){
        deleteBtn.isEnabled = able
    }
    
    func speechMessage(message:String){
        if !message.isEmpty {
            do {
                // 设置语音环境，保证能朗读出声音（特别是刚做过语音识别，这句话必加，不然没声音）
                try audioSession.setCategory(AVAudioSession.Category.ambient)
            }catch let error as NSError{
                print(error.code)
            }
            //需要转的文本
            let utterance = AVSpeechUtterance.init(string: message)
            //设置语言，这里是中文
            utterance.voice = AVSpeechSynthesisVoice.init(language: "zh_CN")
            //设置声音大小
            utterance.volume = 1
            //设置音频
            utterance.pitchMultiplier = 1.1
            //开始朗读
            synth.speak(utterance)
        }
    }

    func setBorder(){
        //设置背景圆角
        backGroundView.layer.cornerRadius = backGroundView.frame.height/32
        backGroundView.layer.masksToBounds = true
        //设置tipLabel边框 左上方Label
        tipLabel.layer.cornerRadius = tipLabel.frame.height/4
        tipLabel.layer.masksToBounds = true
        tipLabel.layer.maskedCorners = CACornerMask(rawValue: CACornerMask.layerMaxXMinYCorner.rawValue | CACornerMask.layerMinXMinYCorner.rawValue | CACornerMask.layerMaxXMaxYCorner.rawValue)
        //设置选词边框圆角
        chooseCollectionView.layer.cornerRadius = chooseCollectionView.frame.height/8
        chooseCollectionView.layer.masksToBounds = true
        //选择结果框紫色边框
        resultView.layer.borderWidth = 3
        resultView.layer.borderColor = #colorLiteral(red: 0.431372549, green: 0.4156862745, blue: 0.8745098039, alpha: 0.8980392157)
        //选择结果框圆角
        resultView.layer.cornerRadius = resultView.frame.height/8
        resultView.layer.masksToBounds = true
        //设置word边框圆角及阴影
        wordCollectionView.layer.cornerRadius = wordCollectionView.frame.height/16
        //设置按钮的阴影
        sportBtn.addShadow(color: .gray, offset: CGSize.zero, opacity: 0.2)
        decorationBtn.addShadow(color: .gray, offset: CGSize.zero, opacity: 0.2)
        relationBtn.addShadow(color: .gray, offset: CGSize.zero, opacity: 0.2)
        toneBtn.addShadow(color: .gray, offset: CGSize.zero, opacity: 0.2)
        chooseShadowBtn.addShadow(color: .gray, offset: CGSize.zero, opacity: 0.2)
        
        floatWindow.layer.cornerRadius = floatWindow.frame.height/24
        floatWindow.layer.shadowColor = UIColor.gray.cgColor
        floatWindow.layer.shadowOffset = CGSize(width: 20, height: 20)
        floatWindow.layer.shadowRadius = floatWindow.frame.height/24
        floatWindow.layer.shadowOpacity = 0.5
        
        outerView.layer.cornerRadius = outerView.frame.height/8
//        outerView.layer.masksToBounds = true
        outerView.layer.shadowColor = UIColor.gray.cgColor
        outerView.layer.shadowOffset = CGSize(width: 20, height: 20)
        outerView.layer.shadowRadius = outerView.frame.height/8
        outerView.layer.shadowOpacity = 0.1
        
        searchView.layer.cornerRadius = searchView.frame.height/8
        searchView.layer.masksToBounds = true
        searchView.layer.borderColor = #colorLiteral(red: 0.5077329874, green: 0.5118077993, blue: 0.8999919295, alpha: 1)
        searchView.layer.borderWidth = 1
        
        DescriptionView.layer.cornerRadius = searchView.frame.height/8
        DescriptionView.layer.masksToBounds = true
    }
    
    func countKeyWords(){
        if(keywordsData.count == 0){
            return
        }
        var dict:[String:Int] = [:]
        chooseWordsData = chooseWordsDict[keywordsData[0]]!
        for i in 0..<chooseWordsData.count{
            if(dict.keys.contains(chooseWordsData[i])){
                dict[chooseWordsData[i]]! += 1
            }else{
                dict[chooseWordsData[i]] = 1
            }
        }
//        var set = Set(chooseData)
        for i in 1..<keywordsData.count{
//            set.formUnion(Set(chooseWordsDict[keywordsData[i]]!))
            chooseWordsData = chooseWordsDict[keywordsData[i]]!
            for j in 0..<chooseWordsData.count{
                if(dict.keys.contains(chooseWordsData[j])){
                    dict[chooseWordsData[j]]! += 1
                }else{
                    dict[chooseWordsData[j]] = 1
                }
            }
        }
//        chooseData = Array(set)
        chooseWordsData = []
        let values = dict.sorted(by: {$0.1 > $1.1})
        for (key, _) in values {
          chooseWordsData.append(key)
        }
        print(chooseWordsData)
    }
    
    @IBAction func showFloatWindow(_ sender: Any) {
        floatWindow.isHidden = false
        shadowCover.isHidden = false
    }
    @IBAction func closeFloatWindow(_ sender: Any) {
        floatWindow.isHidden = true
        shadowCover.isHidden = true
        toFirst()
        keywordsData = []
        keyWordsCollectionView.reloadData()
        self.chooseWordCollectionView.isHidden = true
        self.maskLabelView.isHidden = false
        chooseWordCollectionView.reloadData()
        if(self.showMention){
            var origin = self.lastStep.frame
            self.lastStep.frame = CGRect(x: origin.minX + 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
            origin = self.backtoTop.frame
            self.backtoTop.frame =  CGRect(x: origin.minX + 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
            self.showMention = false
        }
    }
    @IBAction func taptoFirst(_ sender: Any) {
        toFirst()
    }
    func toFirst(){
        if(self.showMention){
            var origin = self.lastStep.frame
            self.lastStep.frame = CGRect(x: origin.minX + 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
            origin = self.backtoTop.frame
            self.backtoTop.frame =  CGRect(x: origin.minX + 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
            self.showMention = false
        }
        step = 0
        history = [0]
        chooseWordsRow = 0
        backtoTop.alpha = 0.0
        lastStep.alpha = 0.0
        needHelp.alpha = 0.0
        let animation = CABasicAnimation(keyPath: "opacity")
        animation.fromValue = 1
        animation.toValue = 0
        animation.duration = 0.5
        animation.delegate = self
        animation.isRemovedOnCompletion = false
        animation.fillMode = CAMediaTimingFillMode.forwards
        mention.layer.add(animation, forKey: "addLayerAnimationOpacity")
    }
    @IBAction func backTop(_ sender: Any) {
        if(step==0){
            
            return
        }
        step -= 1
        if(step==0){
            backtoTop.alpha = 0.0
            lastStep.alpha = 0.0
            needHelp.alpha = 0.0
        }
        history.removeLast()
        chooseWordsRow = history.removeLast()
        history.append(chooseWordsRow)
        let animation = CABasicAnimation(keyPath: "opacity")
        animation.fromValue = 1
        animation.toValue = 0
        animation.duration = 0.5
        animation.delegate = self
        animation.isRemovedOnCompletion = false
        animation.fillMode = CAMediaTimingFillMode.forwards
        mention.layer.add(animation, forKey: "addLayerAnimationOpacity")
    }

    func superUICollectionViewCell(of: UIButton) -> UICollectionViewCell? {
           for view in sequence(first: of.superview, next: { $0?.superview }) {
               if let cell = view as? UICollectionViewCell {
                   return cell
               }
           }
           return nil
       }
    @IBAction func chooseResultWords(_ sender: Any) {
        let btn = sender as! UIButton
        let cell = superUICollectionViewCell(of: btn)!
        let indexPath = chooseWordCollectionView.indexPath(for: cell)
        if(wordsClass.keys.contains(chooseWordsData[indexPath!.row]))
        {
            addWord(words: [chooseWordsData[indexPath!.row]], colorIndex: wordsClass[chooseWordsData[indexPath!.row]]!)
        }else{
            addWord(words: [chooseWordsData[indexPath!.row]], colorIndex: 0)
        }
        closeFloatWindow(AnyObject.self)
    }
    @IBAction func deleteKeyWords(_ sender: Any) {
        let btn = sender as! UIButton
        let cell = superUICollectionViewCell(of: btn)!
        let indexPath = keyWordsCollectionView.indexPath(for: cell)
        keywordsData.remove(at: indexPath!.row)
        keyWordsCollectionView.reloadData()
        if(keywordsData.count == 0){
        
            self.chooseWordCollectionView.isHidden = true
            self.maskLabelView.isHidden = false
        }
        countKeyWords()
        chooseWordCollectionView.reloadData()
    }

    @IBAction func leftBut(_ sender: Any) {
        descriptionCollectionView.scrollToItem(at: IndexPath(row: descriptionCollectionView.indexPathsForVisibleItems.startIndex-3 < 0 ? 0:descriptionCollectionView.indexPathsForVisibleItems.startIndex-3, section: 0), at: .centeredHorizontally, animated: true)

    }
    @IBAction func rightBut(_ sender: Any) {
        descriptionCollectionView.scrollToItem(at: IndexPath(row: descriptionCollectionView.indexPathsForVisibleItems.endIndex+3 > descriptionData.count-1 ? descriptionData.count-1 :descriptionCollectionView.indexPathsForVisibleItems.endIndex+3, section: 0), at: .centeredHorizontally, animated: true)
    }
}


///- Button
extension ViewController{
    @IBAction func leftBtn(_ sender: Any) {
        chooseCollectionView.scrollToItem(at: IndexPath(row: chooseCollectionView.indexPathsForVisibleItems.startIndex - 3 < 0 ? 0 :chooseCollectionView.indexPathsForVisibleItems.startIndex - 3 , section: 0), at: .centeredHorizontally, animated: true)
    }
    
    @IBAction func rightBtn(_ sender: Any) {
        chooseCollectionView.scrollToItem(at: IndexPath(row: chooseCollectionView.indexPathsForVisibleItems.endIndex + 3 > chooseData.count - 1 ? chooseData.count - 1:chooseCollectionView.indexPathsForVisibleItems.endIndex + 3 , section: 0), at: .centeredHorizontally, animated: true)
    }
    
    @IBAction func sportTap(_ sender: Any) {
        chooseRow = 12
        sportBtn.isSelected = true
        relationBtn.isSelected = false
        decorationBtn.isSelected = false
        toneBtn.isSelected = false
        btnSelected.center = sportBtn.center
        print("chooseRow" + chooseRow.description)
        let cell = chooseCollectionView.cellForItem(at: IndexPath.init(item: chooseTop, section: 0)) as! ChooseCollectionViewCell
        cell.isSelected = false
        performSegue(withIdentifier: "btnToPop", sender: self)
    }
    @IBAction func relationTap(_ sender: Any) {
        chooseRow = 14
        sportBtn.isSelected = false
        relationBtn.isSelected = true
        decorationBtn.isSelected = false
        toneBtn.isSelected = false
        btnSelected.center = relationBtn.center
        let cell = chooseCollectionView.cellForItem(at: IndexPath.init(item: chooseTop, section: 0)) as! ChooseCollectionViewCell
        cell.isSelected = false
        performSegue(withIdentifier: "btnToPop", sender: self)
    }
    @IBAction func decorationTap(_ sender: Any) {
        chooseRow = 13
        sportBtn.isSelected = false
        relationBtn.isSelected = false
        decorationBtn.isSelected = true
        toneBtn.isSelected = false
        btnSelected.center = decorationBtn.center
        let cell = chooseCollectionView.cellForItem(at: IndexPath.init(item: chooseTop, section: 0)) as! ChooseCollectionViewCell
        cell.isSelected = false
        performSegue(withIdentifier: "btnToPop", sender: self)
    }
    @IBAction func toneTap(_ sender: Any) {
        chooseRow = 15
        sportBtn.isSelected = false
        relationBtn.isSelected = false
        decorationBtn.isSelected = false
        toneBtn.isSelected = true
        btnSelected.center = toneBtn.center
        let cell = chooseCollectionView.cellForItem(at: IndexPath.init(item: chooseTop, section: 0)) as! ChooseCollectionViewCell
        cell.isSelected = false
        performSegue(withIdentifier: "btnToPop", sender: self)
    }
    @IBAction func playBtn(_ sender: Any) {
        let message = choosedData.joined(separator: "")
        speechMessage(message: message)
    }
    @IBAction func deleteBtn(_ sender: Any) {
        dataHistory.pop()
        colorHistory.pop()
        choosedData = dataHistory.peek() ?? choosedData
        choosedColor = colorHistory.peek() ?? choosedColor
        len4Undo -= 1
        wordCollectionView.reloadData()
    }
    @IBAction func clearBtn(_ sender: Any) {
        choosedData.removeAll()
        choosedColor.removeAll()
        len4Choosed = 0;
        wordCollectionView.reloadData()
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
    }
    @IBAction func tapSentenceBtns(_ sender: UIButton) {
        sentenceSelected.frame = sender.frame
        switch sender.tag{
        case 1:
            sentenceTitle = "餐饮购物"
            break
        case 2:
            sentenceTitle = "日常需求"
            break
        case 3:
            sentenceTitle = "兴趣爱好"
            break
        default:
            sentenceTitle = "医疗健康"
            break
        }
        performSegue(withIdentifier: "toSentence", sender: self)
    }
    
    // 拖拽手势处理
    @objc func handlePanGesture(_ gesture: UIPanGestureRecognizer) {
        switch(gesture.state) {
            
        case .began:
            guard let selectedIndexPath = self.wordCollectionView.indexPathForItem(at: gesture.location(in: self.wordCollectionView)) else {
                break
            }
            // 开始交互
            wordCollectionView.beginInteractiveMovementForItem(at: selectedIndexPath)
        case .changed:
            // 更新位置
            wordCollectionView.updateInteractiveMovementTargetPosition(gesture.location(in: gesture.view!))
        case .ended:
            // 结束交互
            wordCollectionView.endInteractiveMovement()
        default:
            // 默认取消交互
            wordCollectionView.cancelInteractiveMovement()
        }
    }
    
    // 长按手势处理
    @objc func handleLongPressGesture(_ gesture: UILongPressGestureRecognizer) {
        switch(gesture.state) {
            
        case .began:
            guard let selectedIndexPath = self.wordCollectionView.indexPathForItem(at: gesture.location(in: self.wordCollectionView)) else {
                break
            }
            // 开始交互
            let cell = wordCollectionView.cellForItem(at: selectedIndexPath)
            wordCenter = cell!.center
            wordCenter.x = wordCenter.x - wordCollectionView.contentOffset.x
            tempWord = choosedData[selectedIndexPath.item]
            print("tempWord is" + tempWord)
            tempColorIndex = choosedColor[selectedIndexPath.item]
            tempPos = selectedIndexPath.item
//        case .changed:
//            // 更新位置
        case .ended:
            // 结束交互
            performSegue(withIdentifier: "toWordPopOver", sender: self)
        default: break
            // 默认取消交互
            
//            wordCollectionView.cancelInteractiveMovement()
        }
    }
}

//extension ViewController: UICollectionViewDataSource, UICollectionViewDelegate{
//
//    func collectionView(_ collectionView: UICollectionView, numberOfItemsInSection section: Int) -> Int {
//        if collectionView == wordCollectionView{
//            return choosedData.count
//        }
//        else{
//            return chooseData.count
//        }
//    }
//
//    func collectionView(_ collectionView: UICollectionView, didSelectItemAt indexPath: IndexPath) {
//        if collectionView == wordCollectionView{
//
//        }
//        else{
//            let cell = collectionView.cellForItem(at: indexPath)
//            chooseRow = indexPath.row
//            chooseTop = indexPath.row
//            center = cell!.center
//            center.x = center.x - collectionView.contentOffset.x
//            sportBtn.setBackgroundImage(UIImage(named: "活动"), for: .normal)
//            relationBtn.setBackgroundImage(UIImage(named: "关联性"), for: .normal)
//            decorationBtn.setBackgroundImage(UIImage(named: "修饰"), for: .normal)
//            toneBtn.setBackgroundImage(UIImage(named: "语气词"), for: .normal)
//            print(chooseRow)
//            print(indexPath.section)
//        }
//
//    }
//
//    func collectionView(_ collectionView: UICollectionView, cellForItemAt indexPath: IndexPath) -> UICollectionViewCell {
//        if collectionView == wordCollectionView{
//            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "wordCell", for: indexPath) as? WordCollectionViewCell else {
//                fatalError()
//            }
//            cell.imageView.image = UIImage(named: choosedData[indexPath.row])
//            cell.label.text=choosedData[indexPath.row]
//            cell.label.backgroundColor = labelColor[choosedColor[indexPath.row]]
//            cell.backgroundColor = backgroudColor[choosedColor[indexPath.row]]
//            return cell
//        }
//        else{
//            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "chooseCell", for: indexPath) as? ChooseCollectionViewCell else {
//                fatalError()
//            }
//            cell.imageView.frame.size = cell.frame.size
//            cell.imageView.image = UIImage(named: chooseData[indexPath.row])
//
//            return cell
//        }
//
//    }
//
//    func collectionView(_ collectionView: UICollectionView, didDeselectItemAt indexPath: IndexPath) {
//        if collectionView == wordCollectionView{
//
//        }
//        else{
//            let cell = collectionView.cellForItem(at: indexPath)
//            cell?.isSelected = false
//        }
//    }
//
//    /// 更新我们自己的数据源
//    func collectionView(_ collectionView: UICollectionView, moveItemAt sourceIndexPath: IndexPath, to destinationIndexPath: IndexPath) {
//        let word = choosedData.remove(at: sourceIndexPath.item)
//        choosedData.insert(word, at: destinationIndexPath.item)
//        let color = choosedColor.remove(at: sourceIndexPath.item)
//        choosedColor.insert(color, at: destinationIndexPath.item)
//        dataHistory.push(choosedData)
//        colorHistory.push(choosedColor)
//        len4Undo += 1
//    }
//
//
//}


extension ViewController: CAAnimationDelegate ,UICollectionViewDataSource, UICollectionViewDelegate{
    func collectionView(_ collectionView: UICollectionView, layout collectionViewLayout: UICollectionViewLayout, insetForSectionAt section: Int) -> UIEdgeInsets {
            var elements_count = 0
            if collectionView == descriptionCollectionView{
                elements_count = descriptionData.count
            }else if collectionView == keyWordsCollectionView{
                elements_count = keywordsData.count
            }
            else{
                elements_count = chooseWordsData.count
            }
            //Where elements_count is the count of all your items in that
            //Collection view...
            let cellCount = CGFloat(elements_count)
        print(cellCount)
            //If the cell count is zero, there is no point in calculating anything.
            if cellCount > 0 {
                let flowLayout = collectionViewLayout as! UICollectionViewFlowLayout
                let cellWidth = flowLayout.itemSize.width + flowLayout.minimumInteritemSpacing

                //20.00 was just extra spacing I wanted to add to my cell.
                let totalCellWidth = cellWidth*cellCount + 20.00 * (cellCount-1)
                let contentWidth = collectionView.frame.size.width - collectionView.contentInset.left - collectionView.contentInset.right

                if (totalCellWidth < contentWidth) {
                    //If the number of cells that exists take up less room than the
                    //collection view width... then there is an actual point to centering them.

                    //Calculate the right amount of padding to center the cells.
                    let padding = (contentWidth - totalCellWidth) / 2.0
                    return UIEdgeInsets(top: 0, left: padding, bottom: 0, right: padding)
                } else {
                    //Pretty much if the number of cells that exist take up
                    //more room than the actual collectionView width, there is no
                    // point in trying to center them. So we leave the default behavior.
                    return UIEdgeInsets(top: 0, left: 40, bottom: 0, right: 40)
                }
            }

            return UIEdgeInsets.zero
        }
    func collectionView(_ collectionView: UICollectionView, numberOfItemsInSection section: Int) -> Int {
        if collectionView == wordCollectionView{
            return choosedData.count
        }
        else if collectionView == descriptionCollectionView{
            return descriptionData.count
        }else if collectionView == keyWordsCollectionView{
            return keywordsData.count
        }
        else if collectionView == chooseWordCollectionView{
            return chooseWordsData.count
        }
        else{
            return chooseData.count
        }
    }
    
    func collectionView(_ collectionView: UICollectionView, didSelectItemAt indexPath: IndexPath) {
        if collectionView == wordCollectionView{
            
        }
        else if(collectionView == descriptionCollectionView){
            if(someDict.keys.contains(descriptionData[indexPath.row]) && totalData[step+1][someDict[descriptionData[indexPath.row]]!] != [""]){
                chooseWord = descriptionData[indexPath.row]
                chooseWordsRow = someDict[descriptionData[indexPath.row]]!
                step += 1
                lastStep.alpha = 1
                backtoTop.alpha = 1
                history.append(chooseWordsRow)
                let animation = CABasicAnimation(keyPath: "opacity")
                animation.fromValue = 1
                animation.toValue = 0
                animation.duration = 0.5
                animation.delegate = self
                animation.isRemovedOnCompletion = false
                animation.fillMode = CAMediaTimingFillMode.forwards
                mention.layer.add(animation, forKey: "addLayerAnimationOpacity")
            }
            else{
                if !keywordsData.contains(descriptionData[indexPath.row]){
                    chooseWord = descriptionData[indexPath.row]
                    keywordsData.append(descriptionData[indexPath.row])
                    print(descriptionData[indexPath.row])
                    keyWordsCollectionView.reloadData()
                    print("chooseWords")
                    countKeyWords()
                    chooseWordCollectionView.reloadData()
                    self.chooseWordCollectionView.isHidden = false
                    self.maskLabelView.isHidden = true
                    DispatchQueue.main.asyncAfter(deadline: .now() + 1.5) {
                        if(!self.showMention){
                            var origin = self.lastStep.frame
                            self.lastStep.frame = CGRect(x: origin.minX - 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
                            origin = self.backtoTop.frame
                            self.backtoTop.frame =  CGRect(x: origin.minX - 74,y: origin.minY,width: origin.size.width,height: origin.size.height)
                            self.showMention = true
                        }
                        self.needHelp.alpha = 1.0
                        self.mention.text = "没找到目标词吗？可以继续完善信息，或求助身边的人哦"
                    }
                    mention.text = "您已选择“"+chooseWord+"”，上面有您要找的词吗？\n\n也可以试试返回后从其他维度增加描述哦"
                }
            }
            
        }
        else{
            let cell = collectionView.cellForItem(at: indexPath)
            chooseRow = indexPath.row
            chooseTop = indexPath.row
            center = cell!.center
            center.x = center.x - collectionView.contentOffset.x
            sportBtn.setBackgroundImage(UIImage(named: "活动"), for: .normal)
            relationBtn.setBackgroundImage(UIImage(named: "关联性"), for: .normal)
            decorationBtn.setBackgroundImage(UIImage(named: "修饰"), for: .normal)
            toneBtn.setBackgroundImage(UIImage(named: "语气词"), for: .normal)
            print(chooseRow)
            print(indexPath.section)
        }
        
    }
    
    func collectionView(_ collectionView: UICollectionView, cellForItemAt indexPath: IndexPath) -> UICollectionViewCell {
        if collectionView == wordCollectionView{
            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "wordCell", for: indexPath) as? WordCollectionViewCell else {
                fatalError()
            }
            cell.imageView.image = UIImage(named: choosedData[indexPath.row])
            cell.label.text=choosedData[indexPath.row]
            cell.label.backgroundColor = labelColor[choosedColor[indexPath.row]]
            cell.backgroundColor = backgroudColor[choosedColor[indexPath.row]]
            
            return cell
        }
        else if collectionView == chooseWordCollectionView{
            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "chooseWords", for: indexPath) as? WordsChoiceCollectionViewCell else {
                fatalError()
            }
            cell.image.image = UIImage(named: chooseWordsData[indexPath.row])
            cell.label.setTitle(chooseWordsData[indexPath.row], for: .normal)
            return cell
        }else if collectionView == keyWordsCollectionView{
            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "keyWords", for: indexPath) as? KeyWordsCollectionViewCell else {
                fatalError()
            }
            cell.content.image = UIImage(named: keywordsData[indexPath.row])
            cell.keywords.text = keywordsData[indexPath.row]
            return cell
        }
        else if collectionView == descriptionCollectionView{
            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "description", for: indexPath) as? DescriptionCollectionViewCell else {
                fatalError()
            }

            cell.image.image = UIImage(named: descriptionData[indexPath.row])
            cell.label.text = descriptionData[indexPath.row]
            return cell
        }
        else{
            guard let cell = collectionView.dequeueReusableCell(withReuseIdentifier: "chooseCell", for: indexPath) as? ChooseCollectionViewCell else {
                fatalError()
            }
            cell.imageView.frame.size = cell.frame.size
            cell.imageView.image = UIImage(named: chooseData[indexPath.row])
            
            return cell
        }
        
    }
    
    func collectionView(_ collectionView: UICollectionView, didDeselectItemAt indexPath: IndexPath) {
        if collectionView == wordCollectionView{
            
        }
        else{
            let cell = collectionView.cellForItem(at: indexPath)
            cell?.isSelected = false
        }
    }
    func animationDidStop(_ anim: CAAnimation, finished flag: Bool) {
        if flag {
            if(someDict.keys.contains(chooseWord)){
                mention.text = mentionData[step][chooseWordsRow]
            }else{
                mention.text = "嗨！我可以根据您的选择，帮助您查找「目标词」。\n\n您会从以下哪方面来描述这一「目标词」呢？"
            }
            let animation = CABasicAnimation(keyPath: "opacity")
            animation.fromValue = 0
            animation.toValue = 1
            animation.duration = 0.5
            animation.isRemovedOnCompletion = false
            animation.fillMode = CAMediaTimingFillMode.forwards
            mention.layer.add(animation, forKey: "addLayerAnimationOpacity")
            
            descriptionData = totalData[step][chooseWordsRow]
            print(descriptionData)
            descriptionCollectionView.reloadData()
            
        } else {
            print("动画被停止")
        }
    }
    
    /// 更新我们自己的数据源
    func collectionView(_ collectionView: UICollectionView, moveItemAt sourceIndexPath: IndexPath, to destinationIndexPath: IndexPath) {
        let word = choosedData.remove(at: sourceIndexPath.item)
        choosedData.insert(word, at: destinationIndexPath.item)
        let color = choosedColor.remove(at: sourceIndexPath.item)
        choosedColor.insert(color, at: destinationIndexPath.item)
        dataHistory.push(choosedData)
        colorHistory.push(choosedColor)
        len4Undo += 1
    }
}

